# -*- coding: utf-8 -*-

from unstructured.partition.pdf import partition_pdf
from langchain.text_splitter import CharacterTextSplitter
from langchain_core.prompts import ChatPromptTemplate
from langchain_openai import ChatOpenAI
from langchain_core.messages import HumanMessage
from langchain_core.output_parsers import StrOutputParser
from PIL import Image as pil_image
import os
import pickle
import base64
import warnings

warnings.filterwarnings('ignore')

# пути к файлам
# debug code on alternativnye-istochniki-energii.pdf work real on Sber2023.pdf
report_path = "source_pdf_report/Sber2023.pdf"
image_block_output_dir = "./extracted_images"
raw_pdf_elements_pkl = "./pickles/raw_pdf_elements_pkl.pkl"
texts_pkl = "./pickles/texts_pkl.pkl"
tables_pkl = "./pickles/tables_pkl.pkl"
texts_4k_token_pkl = "./pickles/texts_4k_token_pkl.pkl"
text_summaries_pkl = "./pickles/text_summaries_pkl.pkl"
table_summaries_pkl = "./pickles/table_summaries_pkl.pkl"
img_base64_list_pkl = "./pickles/img_base64_list.pkl"
image_summaries_pkl = "./pickles/image_summaries_pkl.pkl"

########################################################################################################################
# определение необходимых для предобработки PDF файла функций
########################################################################################################################
# Функция извлечения элементов из pdf-файла
def extract_pdf_elements(fname, image_output_dir):
    """
    Функция для извлечения различных элементов из PDF-файла, таких как изображения, таблицы,
    и текста. Также осуществляется разбиение текста на части (чанки) для дальнейшей обработки.

    Аргументы:
    path: Строка, содержащая путь к директории, в которую будут сохранены извлеченные изображения.
    fname: Строка, содержащая имя PDF-файла, который необходимо обработать.

    Возвращает:
    Список объектов типа `unstructured.documents.elements`, представляющих извлеченные из PDF элементы.
    """
    return partition_pdf(
        filename=fname,                                 # Путь к файлу, который нужно обработать
        strategy="hi_res",
        extract_images_in_pdf=True,                     # Указание на то, что из PDF нужно извлечь изображения
        infer_table_structure=True,                     # Автоматическое определение структуры таблиц в документе
        chunking_strategy="by_title",                      # Стратегия разбиения текста на части
        multipage_sections=False,                       # False - разделять элементы на разных страницах на отдельные фрагменты
        max_characters=1000,                            # Максимальное количество символов в одном чанке текста
        new_after_n_chars=800,                          # Число символов, после которого начинается новый чанк текста
        combine_text_under_n_chars=200,                 # Минимальное количество символов, при котором чанки объединяются
        extract_image_block_to_payload=False,
        extract_image_block_output_dir=image_output_dir,# куда будут сохраняться извлеченные изображения
        # ocr_languages=["rus", "eng"],                 # языки для OCR - устарело
        languages=["rus", "eng"]                        # языки для текста
    )

# Функция категоризации элементов
def categorize_elements(raw_pdf_elements):
    """
    Функция для категоризации извлеченных элементов из PDF-файла.
    Элементы делятся на текстовые элементы и таблицы.

    Аргументы:
    raw_pdf_elements: Список объектов типа `unstructured.documents.elements`,
                      представляющих извлеченные из PDF элементы.

    Возвращает:
    Два списка: texts (текстовые элементы) и tables (таблицы).
    """
    tables = []  # Список для хранения элементов типа "таблица"
    texts = []   # Список для хранения текстовых элементов
    for element in raw_pdf_elements:
        # Проверка типа элемента. Если элемент является таблицей, добавляем его в список таблиц
        if "unstructured.documents.elements.Table" in str(type(element)):
            tables.append(str(element))
        # Если элемент является композитным текстовым элементом, добавляем его в список текстов
        elif "unstructured.documents.elements.CompositeElement" in str(type(element)):
            texts.append(str(element))
    return texts, tables  # Возвращаем списки с текстами и таблицами

# Функция для суммаризации текста и таблиц
def generate_text_summaries(texts, tables, summarize_texts=False):
    """
    Функция для создания суммаризации текста и таблиц с использованием модели GPT.

    Аргументы:
    texts: Список строк (тексты), которые нужно суммировать.
    tables: Список строк (таблицы), которые нужно суммировать.
    summarize_texts: Булев флаг, указывающий, нужно ли суммировать текстовые элементы.

    Возвращает:
    Два списка: text_summaries (суммаризации текстов) и table_summaries (суммаризации таблиц).
    """

    # Шаблон для запроса к модели. Задача ассистента - создать оптимизированное описание для поиска.
    prompt_text = [
        ("system", "Ты — специалист по саммаризации - созданию кратких и содержательных резюме текста."),
        ("human", """Создай краткое, логичное и ясное по смыслу резюме из текста, следующего за ключевым словом [КОНТЕКСТ].
            Выполняй основные требования к резюме:
            - кратко выделять основные идеи, ключевые мысли;
            - избегать вывода избыточной информации и малоизвестной терминологии, жаргонных слов и аббревиатур;
            - смысл резюме должен быть понятен без исходного текста;
            - не начинай вывод резюме со слова [резюме]
            [КОНТЕКСТ]: {element}
        """),
    ]

    prompt = ChatPromptTemplate(prompt_text)
    # Создаем модель для генерации суммаризаций. Устанавливаем температуру 0 для детерминированных ответов.
    model = ChatOpenAI(temperature=0, model="gpt-4o") # OpenAI API ключ в os.environ["OPENAI_API_KEY"]

    # Определяем цепочку обработки запросов: сначала шаблон запроса, затем модель, затем парсер выходных данных
    summarize_chain = {"element": lambda x: x} | prompt | model | StrOutputParser()

    text_summaries = []  # Список для хранения суммаризаций текстов
    table_summaries = []  # Список для хранения суммаризаций таблиц

    # Если есть текстовые элементы и требуется их суммирование
    if texts and summarize_texts:
        # Выполняем параллельное суммирование текстов
        text_summaries = summarize_chain.batch(texts, {"max_concurrency":5 })
    elif texts:
        # Если суммирование не требуется, просто передаем исходные тексты
        text_summaries = texts

    # Если есть таблицы, выполняем их суммирование
    if tables:
        # Выполняем параллельное суммирование таблиц
        table_summaries = summarize_chain.batch(tables, {"max_concurrency":5 })

    return text_summaries, table_summaries  # Возвращаем результаты суммаризации

# Функция кодирования изображения в формат base64
def encode_image(image_path):
    """
    Функция для кодирования изображения в формат base64.

    Аргументы:
    image_path: Строка, путь к изображению, которое нужно закодировать.

    Возвращает:
    Закодированное в формате base64 изображение в виде строки.
    """
    with open(image_path, "rb") as image_file:
        # Читаем файл изображения в бинарном режиме и кодируем в base64
        return base64.b64encode(image_file.read()).decode("utf-8")

# Функция для суммаризации изображения с использованием модели GPT
def image_summarize(img_base64, prompt):
    """
    Функция для получения суммаризации изображения с использованием GPT модели.

    Аргументы:
    img_base64: Строка, изображение закодированное в формате base64.
    prompt: Строка, запрос для модели GPT, содержащий инструкцию для суммаризации изображения.

    Возвращает:
    Суммаризация изображения, возвращенная моделью GPT.
    """
    # Создаем объект модели GPT с заданными параметрами
    chat = ChatOpenAI(model="gpt-4o", max_tokens=3000) # OpenAI API ключ в os.environ["OPENAI_API_KEY"]

    # Отправляем запрос к модели GPT
    msg = chat.invoke(
        [
            HumanMessage(
                content=[
                    {"type": "text", "text": prompt},  # Запрос для модели
                    {
                        "type": "image_url",  # Тип содержимого - изображение
                        "image_url": {"url": f"data:image/jpeg;base64,{img_base64}"},  # Изображение в формате base64
                    },
                ]
            )
        ]
    )
    # Возвращаем содержимое ответа от модели
    return msg.content

def generate_img_summaries(path):
    """
    Функция для генерации суммаризаций изображений из указанной директории.

    Аргументы:
    path: Строка, путь к директории с изображениями формата .jpg.

    Возвращает:
    Два списка:
    - img_base64_list: Список закодированных изображений в формате base64.
    - image_summaries: Список суммаризаций для каждого изображения.
    """
    img_base64_list = []  # Список для хранения закодированных изображений
    image_summaries = []  # Список для хранения суммаризаций изображений

    # Запрос для модели GPT
    prompt = """Ты — специалист по созданию коротких и содержательных описаний по изображениям.
        Выполняй основные требования к создаваемому описанию по изображению:
        - опиши основные компоненты, предметы, их взаимное расположение цвета, формы и фон;
        - если на изображении или картинке содержится человек или несколько людей, то опиши их количество, пол, возраст, одежду;
        - если на изображении содержится только фон или мало графического контента, то просто сделай вывод о малоинформативном контенте;
    """
    # Обрабатываем все файлы в указанной директории
    list_files = os.listdir(path)
    n_files = len(list_files)
    n_file = 1
    for img_file in sorted(list_files):
        if img_file.endswith(".jpg"):  # Проверяем, что файл имеет расширение .jpg
            img_path = os.path.join(path, img_file)  # Полный путь к изображению
            is_file_reduced = False
            # if os.path.getsize(img_path) > 350000: # will reduce size on 0.5 due ChatOpenAI error too long query
            #     im = pil_image.open(img_path)
            #     new_width = int((float(im.size[0]) * 0.5))
            #     new_height = int((float(im.size[1]) * 0.5))
            #     new_dimensions = (new_width, new_height)
            #     resized_im = im.resize(new_dimensions, pil_image.LANCZOS)
            #     im.close()
            #     resized_im.save(img_path, optimize=True, quality=85)
            #     is_file_reduced = True
            base64_image = encode_image(img_path)  # Кодируем изображение в base64
            img_base64_list.append(base64_image)  # Добавляем закодированное изображение в список
            print(f"\timage processing \t#{n_file} from {n_files}\t{img_file}\t{is_file_reduced}\t{os.path.getsize(img_path)}", flush=True)
            image_summaries.append(image_summarize(base64_image, prompt))  # Получаем суммаризацию изображения
            n_file = n_file + 1

    return img_base64_list, image_summaries  # Возвращаем результаты

########################################################################################################################
# точка входа - начало реальной обработки файла
########################################################################################################################
if not os.path.exists(report_path):
    print(f"file for processing not exists:{report_path}")
    exit(1)

print(f"извлечениe элементов из PDF-файла: {report_path}")
# Извлекаем элементы из PDF-файла с помощью функции extract_pdf_elements
raw_pdf_elements = extract_pdf_elements(report_path, image_block_output_dir)

# сохраняем результаты для дальнейшего использования
with open(raw_pdf_elements_pkl, 'wb') as outp:
    pickle.dump(raw_pdf_elements, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"категоризация элементов извлеченных из PDF-файла")
# Категоризируем извлеченные элементы на текстовые и табличные с помощью функции categorize_elements
texts, tables = categorize_elements(raw_pdf_elements)

# сохраняем результаты для дальнейшего использования
with open(texts_pkl, 'wb') as outp:
    pickle.dump(texts, outp, pickle.HIGHEST_PROTOCOL)

with open(tables_pkl, 'wb') as outp:
    pickle.dump(tables, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"разбиваем объединенный текст на чанки")
# Создаем объект CharacterTextSplitter для разбиения текста на части (чанки)
text_splitter = CharacterTextSplitter.from_tiktoken_encoder(
    chunk_size=1000,    # Максимальный размер чанка в символах
    chunk_overlap=150   # Количество перекрывающихся символов между чанками
)

# Объединяем все текстовые элементы в одну строку
joined_texts = " ".join(texts)

# Разбиваем объединенный текст на чанки, используя созданный CharacterTextSplitter
texts_4k_token = text_splitter.split_text(joined_texts)

# сохраняем результаты для дальнейшего использования
with open(texts_4k_token_pkl, 'wb') as outp:
    pickle.dump(texts_4k_token, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"суммаризация текстов и таблиц извлеченных из PDF-файла")
# Вызываем функцию для суммаризации текстов и таблиц, указывая, что нужно суммировать тексты
text_summaries, table_summaries = generate_text_summaries(texts_4k_token, tables, summarize_texts=True)

# сохраняем результаты для дальнейшего использования
with open(text_summaries_pkl, 'wb') as outp:
    pickle.dump(text_summaries, outp, pickle.HIGHEST_PROTOCOL)

with open(table_summaries_pkl, 'wb') as outp:
    pickle.dump(table_summaries, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"суммаризация изображений извлеченных из PDF-файла")
# Вызываем функцию для генерации суммаризаций изображений
img_base64_list, image_summaries = generate_img_summaries(image_block_output_dir)

# сохраняем результаты для дальнейшего использования
with open(img_base64_list_pkl, 'wb') as outp:
    pickle.dump(img_base64_list, outp, pickle.HIGHEST_PROTOCOL)
with open(image_summaries_pkl, 'wb') as outp:
    pickle.dump(image_summaries, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"вывод статистики предобработки PDF-файла:")
print(f"\tпроверка сохраненных  pkl файлов")

# raw элементы
if not os.path.exists(raw_pdf_elements_pkl):
    print(f"\t\tfile not exists:{raw_pdf_elements_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {raw_pdf_elements_pkl}")
    with open(raw_pdf_elements_pkl, 'rb') as inp:
        raw_pdf_elements = pickle.load(inp)

# text элементы
if not os.path.exists(texts_pkl):
    print(f"\t\tfile not exists:{texts_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {texts_pkl}")
    with open(texts_pkl, 'rb') as inp:
        texts = pickle.load(inp)

# table элементы
if not os.path.exists(tables_pkl):
    print(f"\t\tfile not exists:{tables_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {tables_pkl}")
    with open(tables_pkl, 'rb') as inp:
        tables = pickle.load(inp)

# chank text элементы
if not os.path.exists(texts_4k_token_pkl):
    print(f"\t\tfile not exists:{texts_4k_token_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {texts_4k_token_pkl}")
    with open(texts_4k_token_pkl, 'rb') as inp:
        texts_4k_token = pickle.load(inp)

# summary text элементы
if not os.path.exists(text_summaries_pkl):
    print(f"\t\tfile not exists:{text_summaries_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {text_summaries_pkl}")
    with open(text_summaries_pkl, 'rb') as inp:
        text_summaries = pickle.load(inp)

# summary table элементы
if not os.path.exists(table_summaries_pkl):
    print(f"\t\tfile not exists:{table_summaries_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {table_summaries_pkl}")
    with open(table_summaries_pkl, 'rb') as inp:
        table_summaries = pickle.load(inp)

# img_base64_list элементы
if not os.path.exists(img_base64_list_pkl):
    print(f"\t\tfile not exists:{img_base64_list_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {img_base64_list_pkl}")
    with open(img_base64_list_pkl, 'rb') as inp:
        img_base64_list = pickle.load(inp)

# summary image элементы
if not os.path.exists(image_summaries_pkl):
    print(f"\t\tfile not exists:{image_summaries_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {image_summaries_pkl}")
    with open(image_summaries_pkl, 'rb') as inp:
        image_summaries = pickle.load(inp)

# печать сэмплов данных
n_saples=10
if len(texts) > 0:
        print(f"\tlen(texts)={len(texts)}")
        print("\t", end="")
        print(texts[:n_saples])
if len(tables) > 0:
        print(f"\tlen(tables)={len(tables)}")
        print("\t", end="")
        print(tables[:n_saples])
if len(texts_4k_token) > 0:
        print(f"\tlen(texts_4k_token)={len(texts_4k_token)}")
        print("\t", end="")
        print(texts_4k_token[:n_saples])
if len(text_summaries) > 0:
        print(f"\tlen(text_summaries)={len(text_summaries)}")
        print("\t", end="")
        print(text_summaries[:n_saples])
if len(table_summaries) > 0:
        print(f"\tlen(table_summaries)={len(table_summaries)}")
        print("\t", end="")
        print(table_summaries[:n_saples])
if len(img_base64_list) > 0:
        print(f"\tlen(img_base64_list)={len(img_base64_list)}")
if len(image_summaries) > 0:
        print(f"\tlen(image_summaries)={len(image_summaries)}")
        print("\t", end="")
        print(image_summaries[:n_saples])
print(f"предобработка PDF-файла завершена")

# 	len(texts)=1393
# 	['(5 СБЕР\n\nОб Отчете\n\nПОДХОД К ОТЧЕТУ\n\nВ настоящем Годовом отчете Публичного акционерного общества «Сбербанк России»! за 2023 год (далее — Отчет) содержится информация о результатах деятельно- сти Сбера? за отчетный период с 1 января по 31 декабря 2023 годаз. Данный Отчет состоит из двух частей: Отчет менеджмента и Е5С-отчет. Отчет выходит ежегодно, пре- дыдущий был выпущен в 2023 году по ито- гам 2022 года. Электронные версии Отчетов доступны на корпоративном сайте Www. sberbank.ru.\n\nОтчет подготовлен в соответствии с зако- нодательством Российской Федерации, в том числе:\n\n+ Федеральным законом от 26.12.1995 № 208-ФЗ «Об акционерных обществах»;\n\nакционерными обществами нефинансовой информации, связанной с деятельностью таких обществ»;\n\n* информационным письмом Банка России от 13.07.2023. № ИН-02-28/44 «О реко- мендациях по раскрытию финансовыми организациями информации в области устойчивого развития»;', '. письмом Банка России от 27.12.2021 № ИН-06-28/102 «О раскрытии в годовом отчете публичного акционерного обще- ства отчета о соблюдении принципов и рекомендаций Кодекса корпоративного управления»;\n\n+ Требованиями к подготовке годовых отче- тов акционерных обществ Московской биржи.\n\n+ Федеральным законом от 22.04.1996 № 39-ФЗ «О рынке ценных бумаг»;\n\n+ Положением Банка России от 27.03.2020 № 714-П «О раскрытии информации эми- тентами эмиссионных бумаг»;\n\nВ целях минимизации ограничительных мер, которые дополнительно могут быть вве- дены иностранными государствами в отно- шении Банка, Отчет приведен в соответствие с порядком ограниченного раскрытия инфор- мации согласно:\n\n* информационным письмом Банка России от 12.07.2021 № ИН-06-28/49 «О реко- мендациях по раскрытию публичными\n\n+ Постановлению Правительства Российской Федерации от 04.07.2023 № 1102 «Об особенностях раскрытия и (или)', 'Публичное акционерное общество «Сбербанк России» (ПАО Сбербанк), далее именуемое также Сбербанк или Банк. ПАО Сбербанк и его дочерние банки и дочерние компании, далее совместно именуемые Группа или Сбер. ВОтчете события 2023\n\n>\n\nосвещаются\n\nза\n\nкалендарный год, за исключением случаев, прямо указанных по тексту.\n\nпредоставления информации, подлежащей раскрытию и (или) предоставлению в соот- ветствии с требованиями Федерального закона «Об акционерных обществах» и Федерального закона «О рынке ценных бумаг»;\n\n+ Решению Совета директоров Банка России от 26.12.2023 «О требованиях к раскрытию кредитными организациями (головными кредитными организациями банков- ских групп) отчетности и информации в 2024 году».', 'Для обеспечения качества и сопоставимо- сти раскрываемых данных Отчет подготовлен в соответствии со стандартами Глобальной инициативы по отчетности в области устой- чивого развития (Global Reporting Initiative, GRI) Consolidated Set of the GRI Standards, выпущенными в феврале 2024 года, и Совета по стандартам учета в области устойчивого развития для компаний банковской отрасли (Sustainability Accounting Standards Board, SASB) SASB: Commercial Banks 2023.\n\nКроме Toro, содержание Отчета соответствует положениям и учитывает рекомендации сле- дующих инициатив:\n\n* Принципов Глобального договора ООН;\n\n+ Целей в области устойчивого развития, принятые Генеральной Ассамблеей ООН B 2015 году;\n\n* Принципов ответственной банковской дея- тельности Финансовой инициативы ЮНЕП (Principles for Responsible Banking UNEP Finance Initiative);', '+ Методических рекомендаций Минэконом- развития России по подготовке отчет- ности об устойчивом развитии (приказ Минэкономразвития России от 01.11.2023 № 764);\n\n+ Стандартов МСФО (IFRS) по раскрытию информации в области устойчивого разви- тия $51 и 52 Совета по международным стан- дартам устойчивого развития (ISSB);\n\n+ Рекомендаций Рабочей группы по вопросам раскрытия финансовой информации, свя- занной с изменением климата (Task Force оп Climate-related Financial Disclosures, TCFD).', '(5 СБЕР\n\nДля целей надлежащего отражения нефинансовой инфор- мации, представленной в данном Отчете, а также соот- ветствия Принципам ответственной банковской деятельности Финансовой инициативы ЮНЕП проведены процедуры по независимому заверению в соответствии с Международным стандартом заданий, обеспечивающих уверенность (ISAE 3000) «Задания, обеспечивающие уве- ренность, отличные от аудита и обзорной проверки финан- совой информации прошедших периодов» (подробнее см. в Приложении «Заключения независимого практикую- щего специалиста»).', 'ГРАНИЦЫ ОТЧЕТА\n\nФинансовые данные представлены в Отчете в соответ- ствии с консолидированной финансовой отчетностью по МСФО, если иное прямо не указано по тексту.\n\nОперационные данные представлены в Отчете для ПАО Сбербанк, если иное прямо не указано по тексту.\n\nДанные Е5С-отчета консолидированы по дочер- ним и зависимым организациям, имеющим значи- мое воздействие на окружающую среду, общество и экономику, и раскрыты в отношении ПАО Сбербанк и (или) Группы. Периметр консолидации количествен- ных Е5б-данных является неоднородным в связи с различиями в системах учета данных, применяемых дочерними и зависимыми организациями.', 'УТВЕРЖДЕНИЕ ОТЧЕТА\n\nНастоящий Отчет предварительно утвержден Наблюдательным советом ПАО Сбербанк (Протокол от 23.04.2024 №9).\n\n|\n\nОтчет менеджмента\n\n7 ESG- ь‚ отчет TC Nepern —)\n\nОтчет „Менеджмента\n\n——\n\nYA\n\na', '(< СБЕР\n\n(< СБЕР Отчет менеджмента %Ф Обращение Председателя Наблюдательного совета\n\nОбращение Председателя\n\nНаблюдательного совета\n\nУважаемые клиенты и акционеры!\n\n2023 год стал для российской экономики достаточно успешным благодаря эффективной структурной пере- стройке и адаптации бизнеса к новым реалиям. Деловая активность в ключевых отраслях экономики восстанав- ливалась, увеличивались инвестиции и потребление домохозяйств. В результате ВВП вырос на 3,6%.\n\nФинансовая система сохранила стабильность, а инно- вации и технологический прогресс ускорили создание конкурентных сервисов и продуктов. Чистая прибыль — наиболее яркий индикатор состояния банковского сек- тора. Результат Сбера в 2023 году составил рекордные 1,5 трлн рублей при рентабельности капитала 25%.', 'Сбер продолжил активно развивать направление, связанное с использованием искусственного интел- лекта. В 2023 году он представил рынку мультимо- дальную нейросеть GigaChat, a также обновленную версию Kandinsky 3.0. Тексты по финансовой грамотно- сти от GigaChat и картинки, сгенерированные под них Kandinsky 3.0, представлены на стенде Министерства финансов на выставке «Россия» на ВДНХ.\n\nПолагаю, что дальнейшие инновации, расширение воз- можностей за счет технологий искусственного интел- лекта станут фундаментом для долгосрочного развития и устойчивости бизнеса.\n\nВ прошлом году Сбер активно поддерживал все основ- ные сферы экономики страны. Банк кредитует ведущие организации и компании среднего и малого бизнеса на 23,3 трлн рублей. Существенно вырос объем выдач кредитных продуктов. Совокупный розничный портфель банка превысил 16 трлн рублей. Портфель ипотечных кредитов Сбера вырос на 34,9%, до 10,2 трлн рублей, а доля увеличилась до 55,9%.']
# 	len(tables)=333
# 	['12 Культура выполнения ключевых стратегических целей Обер в цифрах фактах и Сбер сегодня Отчет по рискам 104 Отчет по рискам 13 Миссия и ценности 14 Экосистема В2С в 2023 году 15 Экосистема B2B в 2023 году Корпоративное 118 Система корпоративного управления 16 Сеть продаж в 2023 году 124 Общее собрание акционеров 7 Технологическое лидерство в 2023 году управление 126 Наблюдательный совет 18 Искусственный интеллект в 2023 году 134 Комитеты Наблюдательного совета 19 Управление рисками в 2023 году 140 Исполнительные органы. Правление 20 Ключевые финансовые результаты 141 Корпоративный секретарь 21 Долгосрочное видение и Стратегия 2026 141 Система контроля и аудита 144 Комплаенс и внутренний в Сбере в 2023 контроль году Обзор результатов 147 Кредитные рейтинги Обзор 147 Акционерный 27 рынка Экосистема В2С 151 капитал Взаимодействие с инвесторами и акционерами 58 Экосистема В2В 155 Крупные сделки 76 Сеть продаж 155 Сделки с заинтересованностью', '82 Технологическое лидерство 156 Инвестиционная привлекательность Ринансовая Динамика основных показателей Сбера по МСФО затри года Приложения 158 Отчет о соблюдении принципов и рекомендаций результативность Анализ отчета о прибылях и убытках Кодекса корпоративного управления Банка России Анализ структуры активов 177 Обобщенная консолидированная финансовая отчетность', '31 декабря 31 декабря 31 декабря млрд руб. 2023 года 2022 года Изменение 20211 года Кредиты и авансы клиентам, 37 558 29 373 27,9% 27096 нетто Кредиты и авансы клиентам 39 381 31038 26,9% 28 518 до резервов под кредитные убытки Итого активов 52 307 41 862 25,0% 41166 Средства физических лиц 36 694 29 876 22,8% 28 312 и корпоративных клиентов Итого обязательств 45 723 36 086 26,7% 35 521 Итого собственных средств 6584 5 777 14,0% 5 645', 'млрд руб. 2022 2023 изменение Прибыль за год 287,8 1508,6 x5,2 Операционный доход до резервов под ожидаемые кредитные убытки, включая резервы по обязательствам кредитного характера, и до изме- нения справедливой стоимости кредитного портфеля вследствие изменения кредитного качества 1902,9 3165,0 66,3% Расходы на содержание персонала -726,5 -924,4 27,2% и административные расходы Расходы от создания резервов -450,5 -235,4 под кредитные убытки по долговым финансовым активам -47,7%', 'млрд руб. 2022 2023 млрд руб. % Операции с банковскими картами, включая: 491,6 578,5 86,9 17,7% . эквайринг, комиссии платежных систем и прочие анало- гичные комиссии 411,7 484,2 72,5 17,6% . комиссии, связанные с обслуживанием банковских карт 62,1 61,1 (1,0) -1,6% . прочее 17,8 33,2 15,4 86,5% Расчетно-кассовое обслуживание 283,8 327,7 43,9 15,5% Операции клиентов с иностранной валютой и драгоценными металлами 80,4 50,8 (29,6) -36,8% Комиссии по документарным операциям 36,0 50,4 14,4 40,0% Агентские комиссии полученные 8,6 10,2 1,6 18,6% Комиссии по брокерским операциям с ценными бумагами и товарами, по депозитарному обслуживанию, комиссии, связанные с инвестиционным бизнесом (включая комиссии за синдицирование) 7,2 8,6 1,4 19,4% Прочее 33,0 48,5 15,5 47,0% Комиссионные доходы 940,6 1074,7 134,1 14,3% Комиссионные расходы по операциям с банковскими картами (222,8) (289,3) (66,5) 29,8% Прочие комиссионные расходы (19,3) (21,5) (2,2) 11,4%', 'Комиссионные расходы Чистые комиссионные доходы (242,1) (310,8) (68,7) 28,4% 698,5 763,9 65,4 9,4%', 'пределение риска Описание риска Политики и комитеты по управлению рисками Управление риском и его оценка редитный риск Кредитный риск — риск убытков, связанных с полной или частичной потерей стоимости актива или увеличением обязательств в связи с дефолтом или ухудшением кредитного каче- ства (миграцией) контрагента / эмитента / треть- его лица по следующим инструментам (в том числе полученным в качестве обеспечения): Политика: Основные методы управления кредитными рисками: * Политика управления кредитными рисками; * предупреждение кредитного риска путем идентификации, анализа и оценки потенциаль- ных рисков; + Политика по работе с обеспечением по кредитным продуктам. * планирование уровня кредитного риска через оценку уровня ожидаемых потерь; * ограничение кредитного риска путем установления лимитов и (или) ограничений риска; Комитет по управлению риском: * формирование резервов для покрытия возможных потерь по предоставленным кредитам;', "* финансовому инструменту по сделке с контрагентом; . Комитет ПАО Сбербанк по предоставле- нию кредитов и инвестиций; * управление обеспечением сделок; * и . ценной бумаге эмитента; * производному финансовому инструменту, привязанному к кредитному событию по третьему лицу . Комитет ПАО Сбербанк по рыночным рискам, Комитет ПАО Сбербанк по про- блемным активам, а также иные кол- легиальные рабочие органы Банка и его филиалов (ТБ', FOCB?) в части делегированных полномочий мониторинг контроль уровня кредитного риска. Оценка уровня риска проводится при помощи статистических моделей количественной — РОЗ, LGD‘, EADS. оценки кредитного риска Оценка кредитных рисков контрагентов Группы по сделкам, несущим кредитный риск, в зависимости от типов проводится контрагентов: * корпоративные клиенты -— на основании системы кредитных рейтингов в зависимости от риск-сегмента контрагента, а также путем построения моделей прогнозных денежных", 'потоков; * физические лица — на основании оценки платежеспособности контрагентов, экспресс-оценки, поведенческой информации и информации из внешних источников, имеющейся у Сбербанка. Для ограничения кредитного риска используется многоуровневая система лимитов, в том числе лимиты аппетита к риску Группы ыночный риск орговой книги Рыночный риск торговой книги — риск возник- новения убытков или снижения прибыли вслед- ствие неблагоприятного изменения рыночной стоимости финансовых инструментов, товаров, иностранных валют и драгоценных металлов Политика: Основой системы управления рыночным риском является идентификация риска, его оценка', '* Политика управления рыночным и кре- дитным рисками операций на финансовых рынках. и последующее управление. Основной инструмент управления — установление лимитов рыночных рисков на порт- фельном уровне. Лимиты рыночного риска устанавливаются на четырех уровнях иерархии портфелей, начиная с агрегированного уровня и заканчивая лимитами уровня отдельных субпортфелей или стратегий. Лимиты верхнего уровня представляют собой метрики аппе- Комитет по управлению риском: . Комитет ПАО Сбербанк по рыночным рискам, Комитет ПАО Сбербанк по про- блемным активам, а также иные кол- легиальные рабочие органы Банка и его филиалов (ТБ, ГОСБ) в части делегированных полномочий тита к риску Группы. Основная метрика оценки рыночного риска — стоимость под риском (Value-at-Risk, VaR). Оценку VaR Банк осуществляет методом исторического моделирования с уровнем довери- тельной вероятности 99% на горизонте 10 дней']
# 	len(texts_4k_token)=1028
# 	['(5 СБЕР\n\nОб Отчете\n\nПОДХОД К ОТЧЕТУ\n\nВ настоящем Годовом отчете Публичного акционерного общества «Сбербанк России»! за 2023 год (далее — Отчет) содержится информация о результатах деятельно- сти Сбера? за отчетный период с 1 января по 31 декабря 2023 годаз. Данный Отчет состоит из двух частей: Отчет менеджмента и Е5С-отчет. Отчет выходит ежегодно, пре- дыдущий был выпущен в 2023 году по ито- гам 2022 года. Электронные версии Отчетов доступны на корпоративном сайте Www. sberbank.ru.\n\nОтчет подготовлен в соответствии с зако- нодательством Российской Федерации, в том числе:\n\n+ Федеральным законом от 26.12.1995 № 208-ФЗ «Об акционерных обществах»;\n\nакционерными обществами нефинансовой информации, связанной с деятельностью таких обществ»;', 'акционерными обществами нефинансовой информации, связанной с деятельностью таких обществ»;\n\n* информационным письмом Банка России от 13.07.2023. № ИН-02-28/44 «О реко- мендациях по раскрытию финансовыми организациями информации в области устойчивого развития»; . письмом Банка России от 27.12.2021 № ИН-06-28/102 «О раскрытии в годовом отчете публичного акционерного обще- ства отчета о соблюдении принципов и рекомендаций Кодекса корпоративного управления»;\n\n+ Требованиями к подготовке годовых отче- тов акционерных обществ Московской биржи.\n\n+ Федеральным законом от 22.04.1996 № 39-ФЗ «О рынке ценных бумаг»;\n\n+ Положением Банка России от 27.03.2020 № 714-П «О раскрытии информации эми- тентами эмиссионных бумаг»;\n\nВ целях минимизации ограничительных мер, которые дополнительно могут быть вве- дены иностранными государствами в отно- шении Банка, Отчет приведен в соответствие с порядком ограниченного раскрытия инфор- мации согласно:', '* информационным письмом Банка России от 12.07.2021 № ИН-06-28/49 «О реко- мендациях по раскрытию публичными\n\n+ Постановлению Правительства Российской Федерации от 04.07.2023 № 1102 «Об особенностях раскрытия и (или) Публичное акционерное общество «Сбербанк России» (ПАО Сбербанк), далее именуемое также Сбербанк или Банк. ПАО Сбербанк и его дочерние банки и дочерние компании, далее совместно именуемые Группа или Сбер. ВОтчете события 2023\n\n>\n\nосвещаются\n\nза\n\nкалендарный год, за исключением случаев, прямо указанных по тексту.\n\nпредоставления информации, подлежащей раскрытию и (или) предоставлению в соот- ветствии с требованиями Федерального закона «Об акционерных обществах» и Федерального закона «О рынке ценных бумаг»;', '+ Решению Совета директоров Банка России от 26.12.2023 «О требованиях к раскрытию кредитными организациями (головными кредитными организациями банков- ских групп) отчетности и информации в 2024 году». Для обеспечения качества и сопоставимо- сти раскрываемых данных Отчет подготовлен в соответствии со стандартами Глобальной инициативы по отчетности в области устой- чивого развития (Global Reporting Initiative, GRI) Consolidated Set of the GRI Standards, выпущенными в феврале 2024 года, и Совета по стандартам учета в области устойчивого развития для компаний банковской отрасли (Sustainability Accounting Standards Board, SASB) SASB: Commercial Banks 2023.\n\nКроме Toro, содержание Отчета соответствует положениям и учитывает рекомендации сле- дующих инициатив:\n\n* Принципов Глобального договора ООН;\n\n+ Целей в области устойчивого развития, принятые Генеральной Ассамблеей ООН B 2015 году;', '* Принципов Глобального договора ООН;\n\n+ Целей в области устойчивого развития, принятые Генеральной Ассамблеей ООН B 2015 году;\n\n* Принципов ответственной банковской дея- тельности Финансовой инициативы ЮНЕП (Principles for Responsible Banking UNEP Finance Initiative); + Методических рекомендаций Минэконом- развития России по подготовке отчет- ности об устойчивом развитии (приказ Минэкономразвития России от 01.11.2023 № 764);\n\n+ Стандартов МСФО (IFRS) по раскрытию информации в области устойчивого разви- тия $51 и 52 Совета по международным стан- дартам устойчивого развития (ISSB);\n\n+ Рекомендаций Рабочей группы по вопросам раскрытия финансовой информации, свя- занной с изменением климата (Task Force оп Climate-related Financial Disclosures, TCFD). (5 СБЕР', '+ Рекомендаций Рабочей группы по вопросам раскрытия финансовой информации, свя- занной с изменением климата (Task Force оп Climate-related Financial Disclosures, TCFD). (5 СБЕР\n\nДля целей надлежащего отражения нефинансовой инфор- мации, представленной в данном Отчете, а также соот- ветствия Принципам ответственной банковской деятельности Финансовой инициативы ЮНЕП проведены процедуры по независимому заверению в соответствии с Международным стандартом заданий, обеспечивающих уверенность (ISAE 3000) «Задания, обеспечивающие уве- ренность, отличные от аудита и обзорной проверки финан- совой информации прошедших периодов» (подробнее см. в Приложении «Заключения независимого практикую- щего специалиста»). ГРАНИЦЫ ОТЧЕТА\n\nФинансовые данные представлены в Отчете в соответ- ствии с консолидированной финансовой отчетностью по МСФО, если иное прямо не указано по тексту.', 'Операционные данные представлены в Отчете для ПАО Сбербанк, если иное прямо не указано по тексту.\n\nДанные Е5С-отчета консолидированы по дочер- ним и зависимым организациям, имеющим значи- мое воздействие на окружающую среду, общество и экономику, и раскрыты в отношении ПАО Сбербанк и (или) Группы. Периметр консолидации количествен- ных Е5б-данных является неоднородным в связи с различиями в системах учета данных, применяемых дочерними и зависимыми организациями. УТВЕРЖДЕНИЕ ОТЧЕТА\n\nНастоящий Отчет предварительно утвержден Наблюдательным советом ПАО Сбербанк (Протокол от 23.04.2024 №9).\n\n|\n\nОтчет менеджмента\n\n7 ESG- ь‚ отчет TC Nepern —)\n\nОтчет „Менеджмента\n\n——\n\nYA\n\na (< СБЕР\n\n(< СБЕР Отчет менеджмента %Ф Обращение Председателя Наблюдательного совета\n\nОбращение Председателя\n\nНаблюдательного совета\n\nУважаемые клиенты и акционеры!', 'Обращение Председателя\n\nНаблюдательного совета\n\nУважаемые клиенты и акционеры!\n\n2023 год стал для российской экономики достаточно успешным благодаря эффективной структурной пере- стройке и адаптации бизнеса к новым реалиям. Деловая активность в ключевых отраслях экономики восстанав- ливалась, увеличивались инвестиции и потребление домохозяйств. В результате ВВП вырос на 3,6%.', 'Финансовая система сохранила стабильность, а инно- вации и технологический прогресс ускорили создание конкурентных сервисов и продуктов. Чистая прибыль — наиболее яркий индикатор состояния банковского сек- тора. Результат Сбера в 2023 году составил рекордные 1,5 трлн рублей при рентабельности капитала 25%. Сбер продолжил активно развивать направление, связанное с использованием искусственного интел- лекта. В 2023 году он представил рынку мультимо- дальную нейросеть GigaChat, a также обновленную версию Kandinsky 3.0. Тексты по финансовой грамотно- сти от GigaChat и картинки, сгенерированные под них Kandinsky 3.0, представлены на стенде Министерства финансов на выставке «Россия» на ВДНХ.\n\nПолагаю, что дальнейшие инновации, расширение воз- можностей за счет технологий искусственного интел- лекта станут фундаментом для долгосрочного развития и устойчивости бизнеса.', 'В прошлом году Сбер активно поддерживал все основ- ные сферы экономики страны. Банк кредитует ведущие организации и компании среднего и малого бизнеса на 23,3 трлн рублей. Существенно вырос объем выдач кредитных продуктов. Совокупный розничный портфель банка превысил 16 трлн рублей. Портфель ипотечных кредитов Сбера вырос на 34,9%, до 10,2 трлн рублей, а доля увеличилась до 55,9%. От имени Наблюдательного совета я хочу поблагода- рить всю команду Сбера. Ваши высокий профессио- нализм, креативность и энергия находят отражение в достижениях и высоких показателях Группы.\n\nГодовой показатель CIR, который характеризует OTHO- шение операционных расходов к доходам, впервые в истории Сбера опустился ниже 30%. А. Г. Силуанов\n\nПредседатель Наблюдательного совета ПАО Сбербанк\n\nfe\n\nG СБЕР\n\nG СБЕР Отчет менеджмента %® Обращение Президента, Председателя Правления\n\nОбращение Президента,']
# 	len(text_summaries)=1028
# 	['Годовой отчет ПАО «Сбербанк России» за 2023 год включает результаты деятельности банка за период с 1 января по 31 декабря 2023 года. Он состоит из двух частей: Отчета менеджмента и ESG-отчета. Документ подготовлен в соответствии с российским законодательством, включая Федеральный закон «Об акционерных обществах». Электронные версии отчетов доступны на сайте Сбербанка.', 'Текст касается требований к раскрытию информации акционерными обществами и финансовыми организациями. Основное внимание уделяется рекомендациям Банка России по раскрытию нефинансовой информации и информации в области устойчивого развития. Также упоминаются требования к годовым отчетам акционерных обществ Московской биржи и законодательные акты, регулирующие рынок ценных бумаг и раскрытие информации эмитентами. Целью этих мер является минимизация ограничительных мер со стороны иностранных государств.', 'Банк России выпустил информационное письмо с рекомендациями по раскрытию информации публичными акционерными обществами. Постановление Правительства РФ от 4 июля 2023 года устанавливает особенности раскрытия информации для ПАО Сбербанк и его дочерних компаний. В отчете за 2023 год освещаются события за календарный год, за исключением случаев, указанных в тексте. Раскрытие информации должно соответствовать требованиям законов об акционерных обществах и рынке ценных бумаг.', 'Совет директоров Банка России утвердил требования к раскрытию отчетности кредитными организациями на 2024 год. Отчет подготовлен в соответствии с международными стандартами устойчивого развития, включая GRI и SASB, и учитывает Принципы Глобального договора ООН и Цели устойчивого развития, принятые в 2015 году. Это направлено на обеспечение качества и сопоставимости раскрываемых данных.', 'Текст описывает различные международные и национальные инициативы и стандарты, направленные на поддержку устойчивого развития. Включены Принципы Глобального договора ООН и Цели устойчивого развития, принятые в 2015 году. Также упоминаются Принципы ответственной банковской деятельности ЮНЕП, методические рекомендации Минэкономразвития России по отчетности об устойчивом развитии, стандарты МСФО по раскрытию информации в этой области и рекомендации Рабочей группы по раскрытию финансовой информации, связанной с изменением климата. Эти инициативы и стандарты направлены на улучшение прозрачности и ответственности в вопросах устойчивого развития.', 'Отчет включает нефинансовую информацию, заверенную в соответствии с международным стандартом ISAE 3000, для обеспечения ее достоверности. Финансовые данные представлены на основе консолидированной отчетности по МСФО, если не указано иное. Это соответствует Принципам ответственной банковской деятельности ЮНЕП.', 'Отчет ПАО Сбербанк включает операционные данные, консолидированные по дочерним и зависимым организациям, которые оказывают значительное влияние на окружающую среду, общество и экономику. Консолидация данных неоднородна из-за различий в системах учета. Отчет предварительно утвержден Наблюдательным советом Сбербанка.', 'В 2023 году российская экономика показала успешные результаты благодаря структурной перестройке и адаптации бизнеса. Восстановление деловой активности в ключевых отраслях, рост инвестиций и потребления домохозяйств способствовали увеличению ВВП на 3,6%.', 'Финансовая система остается стабильной, а инновации и технологии способствуют созданию конкурентных продуктов. В 2023 году Сбер достиг рекордной чистой прибыли в 1,5 трлн рублей с рентабельностью капитала 25%. Банк активно развивает искусственный интеллект, представив мультимодальную нейросеть GigaChat и обновленную версию Kandinsky 3.0. Эти технологии демонстрируются на выставке «Россия» и считаются основой для долгосрочного развития и устойчивости бизнеса.', 'В прошлом году Сбербанк активно поддерживал экономику России, предоставив кредиты на 23,3 трлн рублей для крупных, средних и малых предприятий. Объем розничных кредитов превысил 16 трлн рублей, а ипотечный портфель вырос на 34,9%, достигнув 10,2 трлн рублей и увеличив долю до 55,9%. Годовой показатель CIR, отражающий соотношение операционных расходов к доходам, впервые опустился ниже 30%. Наблюдательный совет отметил высокий профессионализм и креативность команды Сбера, что способствовало достижению высоких результатов.']
# 	len(table_summaries)=333
# 	['В 2023 году Сбер сосредоточился на выполнении ключевых стратегических целей, включая развитие экосистем B2C и B2B, технологическое лидерство и внедрение искусственного интеллекта. Организация уделяет внимание корпоративному управлению, управлению рисками и системе контроля и аудита. Финансовые результаты и долгосрочная стратегия до 2026 года подчеркивают стремление к устойчивому росту. Взаимодействие с акционерами и инвесторами, а также управление кредитными рейтингами остаются важными аспектами деятельности компании.', 'Основные идеи текста касаются финансовой динамики и инвестиционной привлекательности Сбера за последние три года. Рассматривается технологическое лидерство компании и анализируются ключевые показатели прибыли и убытков. Также проводится анализ структуры активов и представлена обобщенная консолидированная финансовая отчетность. Отчет включает соблюдение принципов и рекомендаций Кодекса корпоративного управления Банка России.', 'По состоянию на 31 декабря 2023 года кредиты и авансы клиентам увеличились на 27,9% по сравнению с предыдущим годом, составив 37 558 млрд рублей. Кредиты и авансы до резервов под кредитные убытки выросли на 26,9%, достигнув 39 381 млрд рублей. Общая сумма активов увеличилась на 25% и составила 52 307 млрд рублей. Средства физических и корпоративных клиентов возросли на 22,8%, достигнув 36 694 млрд рублей. Общая сумма обязательств увеличилась на 26,7%, составив 45 723 млрд рублей, а собственные средства выросли на 14%, достигнув 6 584 млрд рублей.', 'В 2023 году прибыль компании увеличилась в 5,2 раза по сравнению с 2022 годом, достигнув 1508,6 млрд рублей. Операционный доход до резервов и изменения стоимости кредитного портфеля вырос на 66,3%, составив 3165,0 млрд рублей. Расходы на содержание персонала и административные расходы увеличились на 27,2%, а расходы на создание резервов под кредитные убытки снизились на 47,7%.', 'В 2023 году наблюдается рост операций с банковскими картами на 17,7%, что составляет 578,5 млрд руб. Эквайринг и комиссии платежных систем увеличились на 17,6%, в то время как комиссии за обслуживание карт снизились на 1,6%. Прочие доходы от операций с картами выросли на 86,5%. Доходы от расчетно-кассового обслуживания увеличились на 15,5%, а доходы от операций с иностранной валютой и драгоценными металлами снизились на 36,8%. Комиссии по документарным операциям выросли на 40%, агентские комиссии — на 18,6%, а доходы от брокерских операций и инвестиционного бизнеса — на 19,4%. Общие комиссионные доходы увеличились на 14,3%, достигнув 1074,7 млрд руб., в то время как комиссионные расходы по операциям с банковскими картами выросли на 29,8%.', 'Чистые комиссионные доходы увеличились на 9,4%, составив 763,9, несмотря на рост комиссионных расходов на 28,4%, что привело к увеличению расходов на 68,7.', 'Кредитный риск связан с возможными убытками из-за дефолта или ухудшения кредитного качества контрагента. Управление этим риском включает идентификацию, анализ и оценку потенциальных рисков, а также планирование уровня ожидаемых потерь. Основные методы управления включают установление лимитов, работу с обеспечением и формирование резервов для покрытия возможных потерь. Политики и комитеты по управлению рисками играют ключевую роль в минимизации кредитного риска.', 'Комитет ПАО Сбербанк занимается управлением кредитными и инвестиционными сделками, а также контролем рыночных и проблемных активов. Оценка кредитного риска проводится с использованием статистических моделей, таких как РОЗ, LGD и EADS. Для корпоративных клиентов риск оценивается на основе кредитных рейтингов и прогнозных моделей денежных потоков, что позволяет эффективно управлять кредитными рисками контрагентов.', 'Сбербанк управляет кредитным риском физических лиц, оценивая их платежеспособность и используя поведенческую информацию и данные из внешних источников. Для ограничения риска применяется многоуровневая система лимитов. Управление рыночным риском торговой книги включает идентификацию и оценку риска, связанного с изменением стоимости финансовых инструментов, товаров, валют и драгоценных металлов.', 'Политика управления рыночными и кредитными рисками на финансовых рынках включает установление лимитов на различных уровнях портфелей, от агрегированного до отдельных субпортфелей. Основной инструмент оценки рыночного риска — стоимость под риском (VaR), рассчитываемая методом исторического моделирования с 99% доверительной вероятностью на 10-дневном горизонте. Управление рисками осуществляется через комитеты и рабочие органы ПАО Сбербанк, которые имеют делегированные полномочия.']
# 	len(img_base64_list)=304
# 	len(image_summaries)=304
# 	['На изображении представлен дизайн обложки годового отчёта за 2023 год. В левой верхней части изображено логотип компании, выполненное в виде белого круга и галочки. На переднем плане полупрозрачный круглый элемент, частично пересекающийся с текстами "Годовой отчёт /2023", написанными крупными оранжевыми и белыми буквами. Фон состоит из отражающих стеклянных поверхностей здания и зелёных насаждений, освещённых мягким солнечным светом, придающим картине теплый оттенок.', 'На изображении изображена женщина в спортивной одежде, она участвует в велогонке. Она носит оранжевый шлем, солнцезащитные очки и форму без рукавов. Фоном служит размытие зелёных деревьев, создающие динамичное чувство движения. Слева текст с названием компании и информацией о содержании доклада. Справа находится список разделов с номерами страниц. Изображение выполнено в насыщенных, тёплых цветах с яркими, завихрёнными световыми линиями.', 'На изображении показана сцена сплава по реке. На переднем плане находятся пять человек в спасательных жилетах и касках, они плывут на жёлтой надувной лодке по бурной реке. Люди выглядят как взрослые и, вероятно, участвуют в рафтинге. Вода ярко голубого цвета с белыми всплесками. Вокруг видны зелёные деревья и скалы, которые создают живописный фон с горными пейзажами. Верхний левый угол содержит логотип и текст "Отчет по рискам", а внизу слева — упоминание об использовании инструмента Kandinsky 3.0.', 'На изображении представлена абстрактная композиция, изображающая плавные волнообразные формы. Основные цвета — яркий оранжевый и белый, с переливами желтого. Фон размыт, создавая эффект свечения и текучести, переходя от ярких к более приглушенным оттенкам. Изображение выглядит как игра света и цвета на поверхностях. Информативность изображения ограничена художественной абстракцией.', 'На изображении представлена таблица с категориями рисков. Таблица разбита на шесть разделов:\n\n1. **Операционные риски** с перечислением различных видов, таких как операционный, правовой, комплаенс-риск и другие.\n2. **Рыночные риски** включают риск торговой книги и валютный.\n3. **Прочие риски** охватывают репутационные, налоговые и страховые риски.\n4. **Кредитные риски** состоят из кредитного и странового рисков.\n5. **Бизнес-риски** описывают стратегические и законодательные риски.\n6. **Риск ликвидности** представлен как отдельная категория с указанием на риск ликвидности.\n\nФон изображения белый, а блоки информации разделены визуальными рамками. Каждый раздел имеет свой значок и цветовую маркировку. Внизу указано, что подробности изложены на страницах 111-116.', 'На изображении показан человек, катающийся на серфе по огромной волне с пеной. Он одет в темный гидрокостюм. На заднем плане видно ярко-оранжевое закатное небо с облаками. Волна освещена светом заката, создавая эффектные оттенки синего и оранжевого цветов. Сверху и снизу присутствуют мягкие световые отблески, добавляющие динамики изображению.', 'На изображении находятся двое молодых людей: молодой мужчина в светлой футболке и женщина с длинными светлыми волосами в светлой одежде. Они сидят на диване с декоративными подушками в светлой гостиной. Фон освещен теплым солнечным светом, а в задней части комнаты видны растения и элементы интерьера. Атмосфера изображения уютная и спокойная.', 'Изображение содержит инфографику с несколькими отдельными блоками информации. Слева на фоне голубого градиента представлены данные о клиентах: 108,5 млн розничных клиентов, 81,9 млн пользователей СберБанк Онлайн, 10 млн пользователей СберПрайм. Рядом указаны корпоративные клиенты: 3,2 млн активных клиентов, 2,8 млн пользователей СберБизнес Онлайн. Ниже приведены данные о сотрудниках и офисах. Центральная часть показывает важные факты про «Сбер» — его достижения и статус на рынке. Справа расположен блок "Трансформация Сбера" с описанием стратегии и инновационного подхода в банковских услугах. Верхний фон содержит абстрактное изображение с теплыми цветами.', 'На изображении человек среднего возраста, одетый в спортивную одежду и шлем, взбирается на скалистый склон. На нем рюкзак, и он использует страховочную веревку. Небо ясное, с облаками, а на заднем плане видны живописные горы и долины, окутанные туманом. Камни под ногами выглядят массивными и шероховатыми, местами покрыты мхом и редкой травой.', 'На изображении показаны трое человек: два мужчины и одна женщина. Они идут по коридору современного офисного здания. Мужчины одеты в костюмы серых тонов, а женщина в светло-коричневый пиджак и светлые брюки. Все трое выглядят молодо. Коридор светлый, с большим количеством стеклянных перегородок и высоким потолком. На переднем плане можно заметить надпись "Корпоративное управление". Фон современный и профессиональный, что создает деловую атмосферу.']
# предобработка PDF-файла завершена