# -*- coding: utf-8 -*-

from unstructured.partition.pdf import partition_pdf
from langchain.text_splitter import CharacterTextSplitter
from langchain_core.prompts import ChatPromptTemplate
from langchain_openai import ChatOpenAI
from langchain_core.messages import HumanMessage
from langchain_core.output_parsers import StrOutputParser
from PIL import Image as pil_image
import os
import pickle
import base64
import warnings

warnings.filterwarnings('ignore')

# пути к файлам
# debug code on alternativnye-istochniki-energii.pdf work real on Sber2023.pdf
report_path = "source_pdf_report/Sber2023.pdf"
image_block_output_dir = "./extracted_images"
raw_pdf_elements_pkl = "./pickles/raw_pdf_elements_pkl.pkl"
texts_pkl = "./pickles/texts_pkl.pkl"
tables_pkl = "./pickles/tables_pkl.pkl"
texts_4k_token_pkl = "./pickles/texts_4k_token_pkl.pkl"
text_summaries_pkl = "./pickles/text_summaries_pkl.pkl"
table_summaries_pkl = "./pickles/table_summaries_pkl.pkl"
img_base64_list_pkl = "./pickles/img_base64_list.pkl"
image_summaries_pkl = "./pickles/image_summaries_pkl.pkl"

########################################################################################################################
# определение необходимых для предобработки PDF файла функций
########################################################################################################################
# Функция извлечения элементов из pdf-файла
def extract_pdf_elements(fname, image_output_dir):
    """
    Функция для извлечения различных элементов из PDF-файла, таких как изображения, таблицы,
    и текста. Также осуществляется разбиение текста на части (чанки) для дальнейшей обработки.

    Аргументы:
    path: Строка, содержащая путь к директории, в которую будут сохранены извлеченные изображения.
    fname: Строка, содержащая имя PDF-файла, который необходимо обработать.

    Возвращает:
    Список объектов типа `unstructured.documents.elements`, представляющих извлеченные из PDF элементы.
    """
    return partition_pdf(
        filename=fname,                                 # Путь к файлу, который нужно обработать
        strategy="hi_res",
        extract_images_in_pdf=True,                     # Указание на то, что из PDF нужно извлечь изображения
        infer_table_structure=True,                     # Автоматическое определение структуры таблиц в документе
        chunking_strategy="basic",                      # Стратегия разбиения текста на части
        multipage_sections=False,                       # False - разделять элементы на разных страницах на отдельные фрагменты
        max_characters=1000,                            # Максимальное количество символов в одном чанке текста
        new_after_n_chars=800,                          # Число символов, после которого начинается новый чанк текста
        combine_text_under_n_chars=200,                 # Минимальное количество символов, при котором чанки объединяются
        extract_image_block_to_payload=False,
        extract_image_block_output_dir=image_output_dir,# куда будут сохраняться извлеченные изображения
        # ocr_languages=["rus", "eng"],                 # языки для OCR - устарело
        languages=["rus", "eng"]                        # языки для текста
    )

# Функция категоризации элементов
def categorize_elements(raw_pdf_elements):
    """
    Функция для категоризации извлеченных элементов из PDF-файла.
    Элементы делятся на текстовые элементы и таблицы.

    Аргументы:
    raw_pdf_elements: Список объектов типа `unstructured.documents.elements`,
                      представляющих извлеченные из PDF элементы.

    Возвращает:
    Два списка: texts (текстовые элементы) и tables (таблицы).
    """
    tables = []  # Список для хранения элементов типа "таблица"
    texts = []   # Список для хранения текстовых элементов
    for element in raw_pdf_elements:
        # Проверка типа элемента. Если элемент является таблицей, добавляем его в список таблиц
        if "unstructured.documents.elements.Table" in str(type(element)):
            tables.append(str(element))
        # Если элемент является композитным текстовым элементом, добавляем его в список текстов
        elif "unstructured.documents.elements.CompositeElement" in str(type(element)):
            texts.append(str(element))
    return texts, tables  # Возвращаем списки с текстами и таблицами

# Функция для суммаризации текста и таблиц
def generate_text_summaries(texts, tables, summarize_texts=False):
    """
    Функция для создания суммаризации текста и таблиц с использованием модели GPT.

    Аргументы:
    texts: Список строк (тексты), которые нужно суммировать.
    tables: Список строк (таблицы), которые нужно суммировать.
    summarize_texts: Булев флаг, указывающий, нужно ли суммировать текстовые элементы.

    Возвращает:
    Два списка: text_summaries (суммаризации текстов) и table_summaries (суммаризации таблиц).
    """

    # Шаблон для запроса к модели. Задача ассистента - создать оптимизированное описание для поиска.
    prompt_text = [
        ("system", "Ты — специалист по саммаризации - созданию кратких и содержательных резюме текста."),
        ("human", """Создай краткое, логичное и ясное по смыслу резюме из текста, следующего за ключевым словом [КОНТЕКСТ].
            Выполняй основные требования к резюме:
            - кратко выделять основные идеи, ключевые мысли;
            - избегать вывода избыточной информации и малоизвестной терминологии, жаргонных слов и аббревиатур;
            - смысл резюме должен быть понятен без исходного текста;
            - не начинай вывод резюме со слова [резюме]
            [КОНТЕКСТ]: {element}
        """),
    ]

    prompt = ChatPromptTemplate(prompt_text)
    # Создаем модель для генерации суммаризаций. Устанавливаем температуру 0 для детерминированных ответов.
    model = ChatOpenAI(temperature=0, model="gpt-4o") # OpenAI API ключ в os.environ["OPENAI_API_KEY"]

    # Определяем цепочку обработки запросов: сначала шаблон запроса, затем модель, затем парсер выходных данных
    summarize_chain = {"element": lambda x: x} | prompt | model | StrOutputParser()

    text_summaries = []  # Список для хранения суммаризаций текстов
    table_summaries = []  # Список для хранения суммаризаций таблиц

    # Если есть текстовые элементы и требуется их суммирование
    if texts and summarize_texts:
        # Выполняем параллельное суммирование текстов
        text_summaries = summarize_chain.batch(texts, {"max_concurrency":5 })
    elif texts:
        # Если суммирование не требуется, просто передаем исходные тексты
        text_summaries = texts

    # Если есть таблицы, выполняем их суммирование
    if tables:
        # Выполняем параллельное суммирование таблиц
        table_summaries = summarize_chain.batch(tables, {"max_concurrency":5 })

    return text_summaries, table_summaries  # Возвращаем результаты суммаризации

# Функция кодирования изображения в формат base64
def encode_image(image_path):
    """
    Функция для кодирования изображения в формат base64.

    Аргументы:
    image_path: Строка, путь к изображению, которое нужно закодировать.

    Возвращает:
    Закодированное в формате base64 изображение в виде строки.
    """
    with open(image_path, "rb") as image_file:
        # Читаем файл изображения в бинарном режиме и кодируем в base64
        return base64.b64encode(image_file.read()).decode("utf-8")

# Функция для суммаризации изображения с использованием модели GPT
def image_summarize(img_base64, prompt):
    """
    Функция для получения суммаризации изображения с использованием GPT модели.

    Аргументы:
    img_base64: Строка, изображение закодированное в формате base64.
    prompt: Строка, запрос для модели GPT, содержащий инструкцию для суммаризации изображения.

    Возвращает:
    Суммаризация изображения, возвращенная моделью GPT.
    """
    # Создаем объект модели GPT с заданными параметрами
    chat = ChatOpenAI(model="gpt-4o", max_tokens=3000) # OpenAI API ключ в os.environ["OPENAI_API_KEY"]

    # Отправляем запрос к модели GPT
    msg = chat.invoke(
        [
            HumanMessage(
                content=[
                    {"type": "text", "text": prompt},  # Запрос для модели
                    {
                        "type": "image_url",  # Тип содержимого - изображение
                        "image_url": {"url": f"data:image/jpeg;base64,{img_base64}"},  # Изображение в формате base64
                    },
                ]
            )
        ]
    )
    # Возвращаем содержимое ответа от модели
    return msg.content

def generate_img_summaries(path):
    """
    Функция для генерации суммаризаций изображений из указанной директории.

    Аргументы:
    path: Строка, путь к директории с изображениями формата .jpg.

    Возвращает:
    Два списка:
    - img_base64_list: Список закодированных изображений в формате base64.
    - image_summaries: Список суммаризаций для каждого изображения.
    """
    img_base64_list = []  # Список для хранения закодированных изображений
    image_summaries = []  # Список для хранения суммаризаций изображений

    # Запрос для модели GPT
    prompt = """Ты — специалист по созданию коротких и содержательных описаний по изображениям.
        Выполняй основные требования к создаваемому описанию по изображению:
        - опиши основные компоненты, предметы, их взаимное расположение цвета, формы и фон;
        - если на изображении или картинке содержится человек или несколько людей, то опиши их количество, пол, возраст, одежду;
        - если на изображении содержится только фон или мало графического контента, то просто сделай вывод о малоинформативном контенте;
    """
    # Обрабатываем все файлы в указанной директории
    list_files = os.listdir(path)
    n_files = len(list_files)
    n_file = 1
    for img_file in sorted(list_files):
        if img_file.endswith(".jpg"):  # Проверяем, что файл имеет расширение .jpg
            img_path = os.path.join(path, img_file)  # Полный путь к изображению
            is_file_reduced = False
            # if os.path.getsize(img_path) > 350000: # will reduce size on 0.5 due ChatOpenAI error too long query
            #     im = pil_image.open(img_path)
            #     new_width = int((float(im.size[0]) * 0.5))
            #     new_height = int((float(im.size[1]) * 0.5))
            #     new_dimensions = (new_width, new_height)
            #     resized_im = im.resize(new_dimensions, pil_image.LANCZOS)
            #     im.close()
            #     resized_im.save(img_path, optimize=True, quality=85)
            #     is_file_reduced = True
            base64_image = encode_image(img_path)  # Кодируем изображение в base64
            img_base64_list.append(base64_image)  # Добавляем закодированное изображение в список
            print(f"\timage processing \t#{n_file} from {n_files}\t{img_file}\t{is_file_reduced}\t{os.path.getsize(img_path)}", flush=True)
            image_summaries.append(image_summarize(base64_image, prompt))  # Получаем суммаризацию изображения
            n_file = n_file + 1

    return img_base64_list, image_summaries  # Возвращаем результаты

########################################################################################################################
# точка входа - начало реальной обработки файла
########################################################################################################################
if not os.path.exists(report_path):
    print(f"file for processing not exists:{report_path}")
    exit(1)

print(f"извлечениe элементов из PDF-файла: {report_path}")
# Извлекаем элементы из PDF-файла с помощью функции extract_pdf_elements
raw_pdf_elements = extract_pdf_elements(report_path, image_block_output_dir)

# сохраняем результаты для дальнейшего использования
with open(raw_pdf_elements_pkl, 'wb') as outp:
    pickle.dump(raw_pdf_elements, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"категоризация элементов извлеченных из PDF-файла")
# Категоризируем извлеченные элементы на текстовые и табличные с помощью функции categorize_elements
texts, tables = categorize_elements(raw_pdf_elements)

# сохраняем результаты для дальнейшего использования
with open(texts_pkl, 'wb') as outp:
    pickle.dump(texts, outp, pickle.HIGHEST_PROTOCOL)

with open(tables_pkl, 'wb') as outp:
    pickle.dump(tables, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"разбиваем объединенный текст на чанки")
# Создаем объект CharacterTextSplitter для разбиения текста на части (чанки)
text_splitter = CharacterTextSplitter.from_tiktoken_encoder(
    chunk_size=1000,    # Максимальный размер чанка в символах
    chunk_overlap=150   # Количество перекрывающихся символов между чанками
)

# Объединяем все текстовые элементы в одну строку
joined_texts = " ".join(texts)

# Разбиваем объединенный текст на чанки, используя созданный CharacterTextSplitter
texts_4k_token = text_splitter.split_text(joined_texts)

# сохраняем результаты для дальнейшего использования
with open(texts_4k_token_pkl, 'wb') as outp:
    pickle.dump(texts_4k_token, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"суммаризация текстов и таблиц извлеченных из PDF-файла")
# Вызываем функцию для суммаризации текстов и таблиц, указывая, что нужно суммировать тексты
text_summaries, table_summaries = generate_text_summaries(texts_4k_token, tables, summarize_texts=True)

# сохраняем результаты для дальнейшего использования
with open(text_summaries_pkl, 'wb') as outp:
    pickle.dump(text_summaries, outp, pickle.HIGHEST_PROTOCOL)

with open(table_summaries_pkl, 'wb') as outp:
    pickle.dump(table_summaries, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"суммаризация изображений извлеченных из PDF-файла")
# Вызываем функцию для генерации суммаризаций изображений
img_base64_list, image_summaries = generate_img_summaries(image_block_output_dir)

# сохраняем результаты для дальнейшего использования
with open(img_base64_list_pkl, 'wb') as outp:
    pickle.dump(img_base64_list, outp, pickle.HIGHEST_PROTOCOL)
with open(image_summaries_pkl, 'wb') as outp:
    pickle.dump(image_summaries, outp, pickle.HIGHEST_PROTOCOL)

########################################################################################################################
print(f"вывод статистики предобработки PDF-файла:")
print(f"\tпроверка сохраненных  pkl файлов")

# raw элементы
if not os.path.exists(raw_pdf_elements_pkl):
    print(f"\t\tfile not exists:{raw_pdf_elements_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {raw_pdf_elements_pkl}")
    with open(raw_pdf_elements_pkl, 'rb') as inp:
        raw_pdf_elements = pickle.load(inp)

# text элементы
if not os.path.exists(texts_pkl):
    print(f"\t\tfile not exists:{texts_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {texts_pkl}")
    with open(texts_pkl, 'rb') as inp:
        texts = pickle.load(inp)

# table элементы
if not os.path.exists(tables_pkl):
    print(f"\t\tfile not exists:{tables_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {tables_pkl}")
    with open(tables_pkl, 'rb') as inp:
        tables = pickle.load(inp)

# chank text элементы
if not os.path.exists(texts_4k_token_pkl):
    print(f"\t\tfile not exists:{texts_4k_token_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {texts_4k_token_pkl}")
    with open(texts_4k_token_pkl, 'rb') as inp:
        texts_4k_token = pickle.load(inp)

# summary text элементы
if not os.path.exists(text_summaries_pkl):
    print(f"\t\tfile not exists:{text_summaries_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {text_summaries_pkl}")
    with open(text_summaries_pkl, 'rb') as inp:
        text_summaries = pickle.load(inp)

# summary table элементы
if not os.path.exists(table_summaries_pkl):
    print(f"\t\tfile not exists:{table_summaries_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {table_summaries_pkl}")
    with open(table_summaries_pkl, 'rb') as inp:
        table_summaries = pickle.load(inp)

# img_base64_list элементы
if not os.path.exists(img_base64_list_pkl):
    print(f"\t\tfile not exists:{img_base64_list_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {img_base64_list_pkl}")
    with open(img_base64_list_pkl, 'rb') as inp:
        img_base64_list = pickle.load(inp)

# summary image элементы
if not os.path.exists(image_summaries_pkl):
    print(f"\t\tfile not exists:{image_summaries_pkl}")
    exit(2)
else:
    print(f"\t\tfile - ok: {image_summaries_pkl}")
    with open(image_summaries_pkl, 'rb') as inp:
        image_summaries = pickle.load(inp)

# печать сэмплов данных
n_saples=10
if len(texts) > 0:
        print(f"\tlen(texts)={len(texts)}")
        print("\t", end="")
        print(texts[:n_saples])
if len(tables) > 0:
        print(f"\tlen(tables)={len(tables)}")
        print("\t", end="")
        print(tables[:n_saples])
if len(texts_4k_token) > 0:
        print(f"\tlen(texts_4k_token)={len(texts_4k_token)}")
        print("\t", end="")
        print(texts_4k_token[:n_saples])
if len(text_summaries) > 0:
        print(f"\tlen(text_summaries)={len(text_summaries)}")
        print("\t", end="")
        print(text_summaries[:n_saples])
if len(table_summaries) > 0:
        print(f"\tlen(table_summaries)={len(table_summaries)}")
        print("\t", end="")
        print(table_summaries[:n_saples])
if len(img_base64_list) > 0:
        print(f"\tlen(img_base64_list)={len(img_base64_list)}")
if len(image_summaries) > 0:
        print(f"\tlen(image_summaries)={len(image_summaries)}")
        print("\t", end="")
        print(image_summaries[:n_saples])
print(f"предобработка PDF-файла завершена")

# 	len(texts)=1028
# 	['(5 СБЕР\n\nОб Отчете\n\nПОДХОД К ОТЧЕТУ\n\nВ настоящем Годовом отчете Публичного акционерного общества «Сбербанк России»! за 2023 год (далее — Отчет) содержится информация о результатах деятельно- сти Сбера? за отчетный период с 1 января по 31 декабря 2023 годаз. Данный Отчет состоит из двух частей: Отчет менеджмента и Е5С-отчет. Отчет выходит ежегодно, пре- дыдущий был выпущен в 2023 году по ито- гам 2022 года. Электронные версии Отчетов доступны на корпоративном сайте Www. sberbank.ru.\n\nОтчет подготовлен в соответствии с зако- нодательством Российской Федерации, в том числе:\n\n+ Федеральным законом от 26.12.1995 № 208-ФЗ «Об акционерных обществах»;\n\nакционерными обществами нефинансовой информации, связанной с деятельностью таких обществ»;\n\n* информационным письмом Банка России от 13.07.2023. № ИН-02-28/44 «О реко- мендациях по раскрытию финансовыми организациями информации в области устойчивого развития»;', '. письмом Банка России от 27.12.2021 № ИН-06-28/102 «О раскрытии в годовом отчете публичного акционерного обще- ства отчета о соблюдении принципов и рекомендаций Кодекса корпоративного управления»;\n\n+ Требованиями к подготовке годовых отче- тов акционерных обществ Московской биржи.\n\n+ Федеральным законом от 22.04.1996 № 39-ФЗ «О рынке ценных бумаг»;\n\n+ Положением Банка России от 27.03.2020 № 714-П «О раскрытии информации эми- тентами эмиссионных бумаг»;\n\nВ целях минимизации ограничительных мер, которые дополнительно могут быть вве- дены иностранными государствами в отно- шении Банка, Отчет приведен в соответствие с порядком ограниченного раскрытия инфор- мации согласно:\n\n* информационным письмом Банка России от 12.07.2021 № ИН-06-28/49 «О реко- мендациях по раскрытию публичными\n\n+ Постановлению Правительства Российской Федерации от 04.07.2023 № 1102 «Об особенностях раскрытия и (или)', 'Публичное акционерное общество «Сбербанк России» (ПАО Сбербанк), далее именуемое также Сбербанк или Банк. ПАО Сбербанк и его дочерние банки и дочерние компании, далее совместно именуемые Группа или Сбер. ВОтчете события 2023\n\n>\n\nосвещаются\n\nза\n\nкалендарный год, за исключением случаев, прямо указанных по тексту.\n\nпредоставления информации, подлежащей раскрытию и (или) предоставлению в соот- ветствии с требованиями Федерального закона «Об акционерных обществах» и Федерального закона «О рынке ценных бумаг»;\n\n+ Решению Совета директоров Банка России от 26.12.2023 «О требованиях к раскрытию кредитными организациями (головными кредитными организациями банков- ских групп) отчетности и информации в 2024 году».', 'Для обеспечения качества и сопоставимо- сти раскрываемых данных Отчет подготовлен в соответствии со стандартами Глобальной инициативы по отчетности в области устой- чивого развития (Global Reporting Initiative, GRI) Consolidated Set of the GRI Standards, выпущенными в феврале 2024 года, и Совета по стандартам учета в области устойчивого развития для компаний банковской отрасли (Sustainability Accounting Standards Board, SASB) SASB: Commercial Banks 2023.\n\nКроме Toro, содержание Отчета соответствует положениям и учитывает рекомендации сле- дующих инициатив:\n\n* Принципов Глобального договора ООН;\n\n+ Целей в области устойчивого развития, принятые Генеральной Ассамблеей ООН B 2015 году;\n\n* Принципов ответственной банковской дея- тельности Финансовой инициативы ЮНЕП (Principles for Responsible Banking UNEP Finance Initiative);', '+ Методических рекомендаций Минэконом- развития России по подготовке отчет- ности об устойчивом развитии (приказ Минэкономразвития России от 01.11.2023 № 764);\n\n+ Стандартов МСФО (IFRS) по раскрытию информации в области устойчивого разви- тия $51 и 52 Совета по международным стан- дартам устойчивого развития (ISSB);\n\n+ Рекомендаций Рабочей группы по вопросам раскрытия финансовой информации, свя- занной с изменением климата (Task Force оп Climate-related Financial Disclosures, TCFD).\n\n(5 СБЕР', 'Для целей надлежащего отражения нефинансовой инфор- мации, представленной в данном Отчете, а также соот- ветствия Принципам ответственной банковской деятельности Финансовой инициативы ЮНЕП проведены процедуры по независимому заверению в соответствии с Международным стандартом заданий, обеспечивающих уверенность (ISAE 3000) «Задания, обеспечивающие уве- ренность, отличные от аудита и обзорной проверки финан- совой информации прошедших периодов» (подробнее см. в Приложении «Заключения независимого практикую- щего специалиста»).\n\nГРАНИЦЫ ОТЧЕТА\n\nФинансовые данные представлены в Отчете в соответ- ствии с консолидированной финансовой отчетностью по МСФО, если иное прямо не указано по тексту.\n\nОперационные данные представлены в Отчете для ПАО Сбербанк, если иное прямо не указано по тексту.', 'Данные Е5С-отчета консолидированы по дочер- ним и зависимым организациям, имеющим значи- мое воздействие на окружающую среду, общество и экономику, и раскрыты в отношении ПАО Сбербанк и (или) Группы. Периметр консолидации количествен- ных Е5б-данных является неоднородным в связи с различиями в системах учета данных, применяемых дочерними и зависимыми организациями.\n\nУТВЕРЖДЕНИЕ ОТЧЕТА\n\nНастоящий Отчет предварительно утвержден Наблюдательным советом ПАО Сбербанк (Протокол от 23.04.2024 №9).\n\n|\n\nОтчет менеджмента\n\n7 ESG- ь‚ отчет TC Nepern —)\n\nОтчет „Менеджмента\n\n——\n\nYA\n\na\n\n(< СБЕР\n\n(< СБЕР Отчет менеджмента %Ф Обращение Председателя Наблюдательного совета\n\nОбращение Председателя\n\nНаблюдательного совета\n\nУважаемые клиенты и акционеры!', '2023 год стал для российской экономики достаточно успешным благодаря эффективной структурной пере- стройке и адаптации бизнеса к новым реалиям. Деловая активность в ключевых отраслях экономики восстанав- ливалась, увеличивались инвестиции и потребление домохозяйств. В результате ВВП вырос на 3,6%.\n\nФинансовая система сохранила стабильность, а инно- вации и технологический прогресс ускорили создание конкурентных сервисов и продуктов. Чистая прибыль — наиболее яркий индикатор состояния банковского сек- тора. Результат Сбера в 2023 году составил рекордные 1,5 трлн рублей при рентабельности капитала 25%.\n\nСбер продолжил активно развивать направление, связанное с использованием искусственного интел- лекта. В 2023 году он представил рынку мультимо- дальную нейросеть GigaChat, a также обновленную версию Kandinsky 3.0. Тексты по финансовой грамотно- сти от GigaChat и картинки, сгенерированные под них Kandinsky 3.0, представлены на стенде Министерства финансов на выставке «Россия» на ВДНХ.', 'Полагаю, что дальнейшие инновации, расширение воз- можностей за счет технологий искусственного интел- лекта станут фундаментом для долгосрочного развития и устойчивости бизнеса.\n\nВ прошлом году Сбер активно поддерживал все основ- ные сферы экономики страны. Банк кредитует ведущие организации и компании среднего и малого бизнеса на 23,3 трлн рублей. Существенно вырос объем выдач кредитных продуктов. Совокупный розничный портфель банка превысил 16 трлн рублей. Портфель ипотечных кредитов Сбера вырос на 34,9%, до 10,2 трлн рублей, а доля увеличилась до 55,9%.\n\nОт имени Наблюдательного совета я хочу поблагода- рить всю команду Сбера. Ваши высокий профессио- нализм, креативность и энергия находят отражение в достижениях и высоких показателях Группы.\n\nГодовой показатель CIR, который характеризует OTHO- шение операционных расходов к доходам, впервые в истории Сбера опустился ниже 30%.', 'А. Г. Силуанов\n\nПредседатель Наблюдательного совета ПАО Сбербанк\n\nfe\n\nG СБЕР\n\nG СБЕР Отчет менеджмента %® Обращение Президента, Председателя Правления\n\nОбращение Президента,\n\nПредседателя Правления\n\nУважаемые акционеры, клиенты, партнеры и коллеги!\n\nПо итогам 2023 года российский банковский сектор показал рекордные темпы роста, и, несмотря на нега- тивное влияние внешних факторов, банки сохранили устойчивость и достаточный запас капитала. Их при- быль достигла 3,4 трлн рублей.\n\nа СберБизнеса (интернет-банкинга для корпоративных клиентов) — 2,8 млн пользователей. Уже 10 млн чело- век получают выгоду от подписки СберПрайм, а 75 млн быстро и безопасно входят на сайты и в приложения Сбера и партнеров по Сбер ID.']
# 	len(tables)=333
# 	['12 Культура выполнения ключевых стратегических целей Обер в цифрах фактах и Сбер сегодня Отчет по рискам 104 Отчет по рискам 13 Миссия и ценности 14 Экосистема В2С в 2023 году 15 Экосистема B2B в 2023 году Корпоративное 118 Система корпоративного управления 16 Сеть продаж в 2023 году 124 Общее собрание акционеров 7 Технологическое лидерство в 2023 году управление 126 Наблюдательный совет 18 Искусственный интеллект в 2023 году 134 Комитеты Наблюдательного совета 19 Управление рисками в 2023 году 140 Исполнительные органы. Правление 20 Ключевые финансовые результаты 141 Корпоративный секретарь 21 Долгосрочное видение и Стратегия 2026 141 Система контроля и аудита 144 Комплаенс и внутренний в Сбере в 2023 контроль году Обзор результатов 147 Кредитные рейтинги Обзор 147 Акционерный 27 рынка Экосистема В2С 151 капитал Взаимодействие с инвесторами и акционерами 58 Экосистема В2В 155 Крупные сделки 76 Сеть продаж 155 Сделки с заинтересованностью', '82 Технологическое лидерство 156 Инвестиционная привлекательность Ринансовая Динамика основных показателей Сбера по МСФО затри года Приложения 158 Отчет о соблюдении принципов и рекомендаций результативность Анализ отчета о прибылях и убытках Кодекса корпоративного управления Банка России Анализ структуры активов 177 Обобщенная консолидированная финансовая отчетность', 'млрд руб. 2022 2023 млрд руб. % Операции с банковскими картами, включая: 491,6 578,5 86,9 17,7% . эквайринг, комиссии платежных систем и прочие анало- гичные комиссии 411,7 484,2 72,5 17,6% . комиссии, связанные с обслуживанием банковских карт 62,1 61,1 (1,0) -1,6% . прочее 17,8 33,2 15,4 86,5% Расчетно-кассовое обслуживание 283,8 327,7 43,9 15,5% Операции клиентов с иностранной валютой и драгоценными металлами 80,4 50,8 (29,6) -36,8% Комиссии по документарным операциям 36,0 50,4 14,4 40,0% Агентские комиссии полученные 8,6 10,2 1,6 18,6% Комиссии по брокерским операциям с ценными бумагами и товарами, по депозитарному обслуживанию, комиссии, связанные с инвестиционным бизнесом (включая комиссии за синдицирование) 7,2 8,6 1,4 19,4% Прочее 33,0 48,5 15,5 47,0% Комиссионные доходы 940,6 1074,7 134,1 14,3% Комиссионные расходы по операциям с банковскими картами (222,8) (289,3) (66,5) 29,8% Прочие комиссионные расходы (19,3) (21,5) (2,2) 11,4%', 'Комиссионные расходы Чистые комиссионные доходы (242,1) (310,8) (68,7) 28,4% 698,5 763,9 65,4 9,4%', 'пределение риска Описание риска Политики и комитеты по управлению рисками Управление риском и его оценка редитный риск Кредитный риск — риск убытков, связанных с полной или частичной потерей стоимости актива или увеличением обязательств в связи с дефолтом или ухудшением кредитного каче- ства (миграцией) контрагента / эмитента / треть- его лица по следующим инструментам (в том числе полученным в качестве обеспечения): Политика: Основные методы управления кредитными рисками: * Политика управления кредитными рисками; * предупреждение кредитного риска путем идентификации, анализа и оценки потенциаль- ных рисков; + Политика по работе с обеспечением по кредитным продуктам. * планирование уровня кредитного риска через оценку уровня ожидаемых потерь; * ограничение кредитного риска путем установления лимитов и (или) ограничений риска; Комитет по управлению риском: * формирование резервов для покрытия возможных потерь по предоставленным кредитам;', "* финансовому инструменту по сделке с контрагентом; . Комитет ПАО Сбербанк по предоставле- нию кредитов и инвестиций; * управление обеспечением сделок; * и . ценной бумаге эмитента; * производному финансовому инструменту, привязанному к кредитному событию по третьему лицу . Комитет ПАО Сбербанк по рыночным рискам, Комитет ПАО Сбербанк по про- блемным активам, а также иные кол- легиальные рабочие органы Банка и его филиалов (ТБ', FOCB?) в части делегированных полномочий мониторинг контроль уровня кредитного риска. Оценка уровня риска проводится при помощи статистических моделей количественной — РОЗ, LGD‘, EADS. оценки кредитного риска Оценка кредитных рисков контрагентов Группы по сделкам, несущим кредитный риск, в зависимости от типов проводится контрагентов: * корпоративные клиенты -— на основании системы кредитных рейтингов в зависимости от риск-сегмента контрагента, а также путем построения моделей прогнозных денежных", 'потоков; * физические лица — на основании оценки платежеспособности контрагентов, экспресс-оценки, поведенческой информации и информации из внешних источников, имеющейся у Сбербанка. Для ограничения кредитного риска используется многоуровневая система лимитов, в том числе лимиты аппетита к риску Группы ыночный риск орговой книги Рыночный риск торговой книги — риск возник- новения убытков или снижения прибыли вслед- ствие неблагоприятного изменения рыночной стоимости финансовых инструментов, товаров, иностранных валют и драгоценных металлов Политика: Основой системы управления рыночным риском является идентификация риска, его оценка', '* Политика управления рыночным и кре- дитным рисками операций на финансовых рынках. и последующее управление. Основной инструмент управления — установление лимитов рыночных рисков на порт- фельном уровне. Лимиты рыночного риска устанавливаются на четырех уровнях иерархии портфелей, начиная с агрегированного уровня и заканчивая лимитами уровня отдельных субпортфелей или стратегий. Лимиты верхнего уровня представляют собой метрики аппе- Комитет по управлению риском: . Комитет ПАО Сбербанк по рыночным рискам, Комитет ПАО Сбербанк по про- блемным активам, а также иные кол- легиальные рабочие органы Банка и его филиалов (ТБ, ГОСБ) в части делегированных полномочий тита к риску Группы. Основная метрика оценки рыночного риска — стоимость под риском (Value-at-Risk, VaR). Оценку VaR Банк осуществляет методом исторического моделирования с уровнем довери- тельной вероятности 99% на горизонте 10 дней', '-трановой риск Страновой риск — риск убытков, связанных с невозможностью либо нежеланием следующих видов контрагентов: * резидентов иностранного государства (в TOM Политика: Страновой риск относится к группе кредитного риска. * Политика управления страновым риском. Для управления страновым риском в Банке установлены лимиты и проводится регуляр- Комитет по управлению риском: ный мониторинг экономической ситуации в странах, в которых Банк уже несет риски, а также в которых планирует новые сделки числе суверенов); * имеющих активы на территории иностранного . Комитет ПАО Сбербанк по предоставле- нию кредитов и инвестиций государства; * несущих конечный риск в иностранном государ- стве (то есть если с резидентами иностранного государства связано формирование источников погашения обязательств контрагента). выполнить свои обязательства вследствие эко-', 'номических, политических, социальных измене- ний, произошедших в иностранном государстве, либо вследствие того, что валюта иностранного государства может быть недоступна контрагенту из-за особенностей локального и (или) националь- ного законодательства (независимо от финансо- вого положения самого контрагента) ck кибер- ‚езопасности Риск кибербезопасности — риск реализации угроз безопасности информации, которые обу- словлены недостатками процессов обеспече- ния информационной безопасности, в том числе проведения технологических и других меропри- ятий, недостатками прикладного программного обеспечения автоматизированных систем и при- ложений, а также несоответствием указанных процессов деятельности организации Политика: К управлению риском кибербезопасности (КБ) в Группе применяется процессно-ориентиро-']
# 	len(texts_4k_token)=860
# 	['(5 СБЕР\n\nОб Отчете\n\nПОДХОД К ОТЧЕТУ\n\nВ настоящем Годовом отчете Публичного акционерного общества «Сбербанк России»! за 2023 год (далее — Отчет) содержится информация о результатах деятельно- сти Сбера? за отчетный период с 1 января по 31 декабря 2023 годаз. Данный Отчет состоит из двух частей: Отчет менеджмента и Е5С-отчет. Отчет выходит ежегодно, пре- дыдущий был выпущен в 2023 году по ито- гам 2022 года. Электронные версии Отчетов доступны на корпоративном сайте Www. sberbank.ru.\n\nОтчет подготовлен в соответствии с зако- нодательством Российской Федерации, в том числе:\n\n+ Федеральным законом от 26.12.1995 № 208-ФЗ «Об акционерных обществах»;\n\nакционерными обществами нефинансовой информации, связанной с деятельностью таких обществ»;\n\n* информационным письмом Банка России от 13.07.2023. № ИН-02-28/44 «О реко- мендациях по раскрытию финансовыми организациями информации в области устойчивого развития»; . письмом Банка России от 27.12.2021 № ИН-06-28/102 «О раскрытии в годовом отчете публичного акционерного обще- ства отчета о соблюдении принципов и рекомендаций Кодекса корпоративного управления»;', '+ Требованиями к подготовке годовых отче- тов акционерных обществ Московской биржи.\n\n+ Федеральным законом от 22.04.1996 № 39-ФЗ «О рынке ценных бумаг»;\n\n+ Положением Банка России от 27.03.2020 № 714-П «О раскрытии информации эми- тентами эмиссионных бумаг»;\n\nВ целях минимизации ограничительных мер, которые дополнительно могут быть вве- дены иностранными государствами в отно- шении Банка, Отчет приведен в соответствие с порядком ограниченного раскрытия инфор- мации согласно:\n\n* информационным письмом Банка России от 12.07.2021 № ИН-06-28/49 «О реко- мендациях по раскрытию публичными\n\n+ Постановлению Правительства Российской Федерации от 04.07.2023 № 1102 «Об особенностях раскрытия и (или) Публичное акционерное общество «Сбербанк России» (ПАО Сбербанк), далее именуемое также Сбербанк или Банк. ПАО Сбербанк и его дочерние банки и дочерние компании, далее совместно именуемые Группа или Сбер. ВОтчете события 2023\n\n>\n\nосвещаются\n\nза\n\nкалендарный год, за исключением случаев, прямо указанных по тексту.', '>\n\nосвещаются\n\nза\n\nкалендарный год, за исключением случаев, прямо указанных по тексту.\n\nпредоставления информации, подлежащей раскрытию и (или) предоставлению в соот- ветствии с требованиями Федерального закона «Об акционерных обществах» и Федерального закона «О рынке ценных бумаг»;\n\n+ Решению Совета директоров Банка России от 26.12.2023 «О требованиях к раскрытию кредитными организациями (головными кредитными организациями банков- ских групп) отчетности и информации в 2024 году». Для обеспечения качества и сопоставимо- сти раскрываемых данных Отчет подготовлен в соответствии со стандартами Глобальной инициативы по отчетности в области устой- чивого развития (Global Reporting Initiative, GRI) Consolidated Set of the GRI Standards, выпущенными в феврале 2024 года, и Совета по стандартам учета в области устойчивого развития для компаний банковской отрасли (Sustainability Accounting Standards Board, SASB) SASB: Commercial Banks 2023.\n\nКроме Toro, содержание Отчета соответствует положениям и учитывает рекомендации сле- дующих инициатив:\n\n* Принципов Глобального договора ООН;\n\n+ Целей в области устойчивого развития, принятые Генеральной Ассамблеей ООН B 2015 году;', '* Принципов Глобального договора ООН;\n\n+ Целей в области устойчивого развития, принятые Генеральной Ассамблеей ООН B 2015 году;\n\n* Принципов ответственной банковской дея- тельности Финансовой инициативы ЮНЕП (Principles for Responsible Banking UNEP Finance Initiative); + Методических рекомендаций Минэконом- развития России по подготовке отчет- ности об устойчивом развитии (приказ Минэкономразвития России от 01.11.2023 № 764);\n\n+ Стандартов МСФО (IFRS) по раскрытию информации в области устойчивого разви- тия $51 и 52 Совета по международным стан- дартам устойчивого развития (ISSB);\n\n+ Рекомендаций Рабочей группы по вопросам раскрытия финансовой информации, свя- занной с изменением климата (Task Force оп Climate-related Financial Disclosures, TCFD).', '+ Рекомендаций Рабочей группы по вопросам раскрытия финансовой информации, свя- занной с изменением климата (Task Force оп Climate-related Financial Disclosures, TCFD).\n\n(5 СБЕР Для целей надлежащего отражения нефинансовой инфор- мации, представленной в данном Отчете, а также соот- ветствия Принципам ответственной банковской деятельности Финансовой инициативы ЮНЕП проведены процедуры по независимому заверению в соответствии с Международным стандартом заданий, обеспечивающих уверенность (ISAE 3000) «Задания, обеспечивающие уве- ренность, отличные от аудита и обзорной проверки финан- совой информации прошедших периодов» (подробнее см. в Приложении «Заключения независимого практикую- щего специалиста»).\n\nГРАНИЦЫ ОТЧЕТА\n\nФинансовые данные представлены в Отчете в соответ- ствии с консолидированной финансовой отчетностью по МСФО, если иное прямо не указано по тексту.', 'Операционные данные представлены в Отчете для ПАО Сбербанк, если иное прямо не указано по тексту. Данные Е5С-отчета консолидированы по дочер- ним и зависимым организациям, имеющим значи- мое воздействие на окружающую среду, общество и экономику, и раскрыты в отношении ПАО Сбербанк и (или) Группы. Периметр консолидации количествен- ных Е5б-данных является неоднородным в связи с различиями в системах учета данных, применяемых дочерними и зависимыми организациями.\n\nУТВЕРЖДЕНИЕ ОТЧЕТА\n\nНастоящий Отчет предварительно утвержден Наблюдательным советом ПАО Сбербанк (Протокол от 23.04.2024 №9).\n\n|\n\nОтчет менеджмента\n\n7 ESG- ь‚ отчет TC Nepern —)\n\nОтчет „Менеджмента\n\n——\n\nYA\n\na\n\n(< СБЕР\n\n(< СБЕР Отчет менеджмента %Ф Обращение Председателя Наблюдательного совета\n\nОбращение Председателя\n\nНаблюдательного совета', 'YA\n\na\n\n(< СБЕР\n\n(< СБЕР Отчет менеджмента %Ф Обращение Председателя Наблюдательного совета\n\nОбращение Председателя\n\nНаблюдательного совета\n\nУважаемые клиенты и акционеры! 2023 год стал для российской экономики достаточно успешным благодаря эффективной структурной пере- стройке и адаптации бизнеса к новым реалиям. Деловая активность в ключевых отраслях экономики восстанав- ливалась, увеличивались инвестиции и потребление домохозяйств. В результате ВВП вырос на 3,6%.\n\nФинансовая система сохранила стабильность, а инно- вации и технологический прогресс ускорили создание конкурентных сервисов и продуктов. Чистая прибыль — наиболее яркий индикатор состояния банковского сек- тора. Результат Сбера в 2023 году составил рекордные 1,5 трлн рублей при рентабельности капитала 25%.', 'Сбер продолжил активно развивать направление, связанное с использованием искусственного интел- лекта. В 2023 году он представил рынку мультимо- дальную нейросеть GigaChat, a также обновленную версию Kandinsky 3.0. Тексты по финансовой грамотно- сти от GigaChat и картинки, сгенерированные под них Kandinsky 3.0, представлены на стенде Министерства финансов на выставке «Россия» на ВДНХ. Полагаю, что дальнейшие инновации, расширение воз- можностей за счет технологий искусственного интел- лекта станут фундаментом для долгосрочного развития и устойчивости бизнеса.\n\nВ прошлом году Сбер активно поддерживал все основ- ные сферы экономики страны. Банк кредитует ведущие организации и компании среднего и малого бизнеса на 23,3 трлн рублей. Существенно вырос объем выдач кредитных продуктов. Совокупный розничный портфель банка превысил 16 трлн рублей. Портфель ипотечных кредитов Сбера вырос на 34,9%, до 10,2 трлн рублей, а доля увеличилась до 55,9%.\n\nОт имени Наблюдательного совета я хочу поблагода- рить всю команду Сбера. Ваши высокий профессио- нализм, креативность и энергия находят отражение в достижениях и высоких показателях Группы.', 'Годовой показатель CIR, который характеризует OTHO- шение операционных расходов к доходам, впервые в истории Сбера опустился ниже 30%. А. Г. Силуанов\n\nПредседатель Наблюдательного совета ПАО Сбербанк\n\nfe\n\nG СБЕР\n\nG СБЕР Отчет менеджмента %® Обращение Президента, Председателя Правления\n\nОбращение Президента,\n\nПредседателя Правления\n\nУважаемые акционеры, клиенты, партнеры и коллеги!\n\nПо итогам 2023 года российский банковский сектор показал рекордные темпы роста, и, несмотря на нега- тивное влияние внешних факторов, банки сохранили устойчивость и достаточный запас капитала. Их при- быль достигла 3,4 трлн рублей.', 'а СберБизнеса (интернет-банкинга для корпоративных клиентов) — 2,8 млн пользователей. Уже 10 млн чело- век получают выгоду от подписки СберПрайм, а 75 млн быстро и безопасно входят на сайты и в приложения Сбера и партнеров по Сбер ID. С лета 2023 года ключевая ставка была увели- чена Банком России более чем вдвое — с 7,5 до 16% годовых — на фоне сильных инфляционных рисков. При этом повышение ставки было вызвано стреми- тельным ростом экономики, структурная трансформа- ция которой проходит быстрее самых оптимистичных ожиданий: рост ВВП по итогам 2023 года превысил 3,6%. Этот фактор оказал влияние на динамику бан- ковских рынков, а также потребовал от банков своев- ременной адаптации.']
# 	len(text_summaries)=860
# 	['Годовой отчет ПАО «Сбербанк России» за 2023 год включает результаты деятельности банка за период с 1 января по 31 декабря 2023 года. Он состоит из двух частей: Отчета менеджмента и ESG-отчета. Документ подготовлен в соответствии с российским законодательством, включая законы об акционерных обществах и рекомендации Банка России по раскрытию информации в области устойчивого развития и корпоративного управления. Электронные версии отчетов доступны на сайте Сбербанка.', 'Годовой отчет акционерных обществ Московской биржи, включая ПАО Сбербанк и его дочерние компании, подготовлен в соответствии с требованиями российского законодательства, включая Федеральный закон «О рынке ценных бумаг» и положения Банка России о раскрытии информации эмитентами. В целях минимизации возможных ограничительных мер со стороны иностранных государств, отчет составлен с учетом рекомендаций по ограниченному раскрытию информации. В документе освещены события за 2023 год, за исключением специально оговоренных случаев.', 'Отчет за календарный год подготовлен в соответствии с требованиями Федерального закона «Об акционерных обществах» и «О рынке ценных бумаг», а также решением Совета директоров Банка России от 26.12.2023. Для обеспечения качества и сопоставимости данных он соответствует стандартам Глобальной инициативы по отчетности в области устойчивого развития (GRI) и Совета по стандартам учета в области устойчивого развития для банковской отрасли (SASB). Отчет также учитывает Принципы Глобального договора ООН и Цели устойчивого развития, принятые Генеральной Ассамблеей ООН в 2015 году.', 'Текст описывает основные международные и национальные инициативы и стандарты, направленные на устойчивое развитие и ответственное ведение бизнеса. Включены Принципы Глобального договора ООН и Цели устойчивого развития, принятые в 2015 году. Также упоминаются Принципы ответственной банковской деятельности ЮНЕП, методические рекомендации Минэкономразвития России по отчетности об устойчивом развитии, стандарты МСФО по раскрытию информации в этой области и рекомендации Рабочей группы по раскрытию финансовой информации, связанной с изменением климата. Эти документы и рекомендации служат основой для формирования устойчивых практик в бизнесе и экономике.', 'Отчет включает нефинансовую информацию, заверенную в соответствии с международными стандартами, для соответствия Принципам ответственной банковской деятельности ЮНЕП. Финансовые данные представлены на основе консолидированной отчетности по МСФО, если не указано иное.', 'Отчет ПАО Сбербанк включает операционные данные, касающиеся влияния на окружающую среду, общество и экономику, и охватывает дочерние и зависимые организации. Консолидация данных неоднородна из-за различий в системах учета. Отчет предварительно утвержден Наблюдательным советом Сбербанка.', 'В 2023 году российская экономика показала успешные результаты благодаря структурной перестройке и адаптации бизнеса. Восстановление деловой активности, рост инвестиций и потребления способствовали увеличению ВВП на 3,6%. Финансовая система оставалась стабильной, а инновации ускорили развитие конкурентных продуктов. Сбер достиг рекордной чистой прибыли в 1,5 трлн рублей с рентабельностью капитала 25%.', 'Сбер активно развивает технологии искусственного интеллекта, представив в 2023 году мультимодальную нейросеть GigaChat и обновленную версию Kandinsky 3.0. Эти разработки демонстрируются на выставке «Россия» на ВДНХ. Банк также поддерживает экономику, кредитуя крупные и малые предприятия на 23,3 трлн рублей, с ростом розничного кредитного портфеля до 16 трлн рублей и увеличением ипотечного портфеля на 34,9%. Наблюдательный совет выражает благодарность команде Сбера за профессионализм и достижения.', 'В 2023 году российский банковский сектор продемонстрировал рекордные темпы роста, сохраняя устойчивость и достаточный запас капитала, несмотря на внешние негативные факторы. Прибыль банков составила 3,4 трлн рублей. Впервые в истории Сбербанка показатель CIR, отражающий соотношение операционных расходов к доходам, опустился ниже 30%.', 'СберБизнес, интернет-банкинг для корпоративных клиентов, насчитывает 2,8 млн пользователей. Подписка СберПрайм приносит выгоду 10 млн человек, а 75 млн используют Сбер ID для быстрого и безопасного входа на сайты и приложения. С лета 2023 года Банк России увеличил ключевую ставку с 7,5% до 16% годовых из-за инфляционных рисков и быстрого роста экономики, который превысил 3,6% ВВП. Это изменение повлияло на банковские рынки и потребовало от банков адаптации.']
# 	len(table_summaries)=333
# 	['В 2023 году Сбер сосредоточился на выполнении ключевых стратегических целей, включая развитие экосистем B2C и B2B, технологическое лидерство и внедрение искусственного интеллекта. Организация уделяет внимание управлению рисками и корпоративному управлению, включая работу наблюдательного совета и исполнительных органов. Финансовые результаты и долгосрочная стратегия до 2026 года подчеркивают стремление к устойчивому росту. Важными аспектами остаются взаимодействие с акционерами и инвесторами, а также поддержание системы контроля и аудита.', 'Основные идеи текста касаются финансовой динамики и инвестиционной привлекательности Сбера за последние три года. Рассматриваются ключевые показатели по международным стандартам финансовой отчетности (МСФО), включая анализ прибыли и убытков, а также структура активов. Также упоминается соблюдение принципов корпоративного управления, установленных Банком России.', 'В 2023 году наблюдается рост операций с банковскими картами на 17,7%, в основном за счет увеличения эквайринга и комиссий платежных систем. Комиссии за обслуживание карт снизились на 1,6%. Расчетно-кассовое обслуживание выросло на 15,5%, а операции с иностранной валютой и драгоценными металлами сократились на 36,8%. Комиссии по документарным операциям увеличились на 40%, а агентские комиссии — на 18,6%. Общие комиссионные доходы выросли на 14,3%, несмотря на рост комиссионных расходов по операциям с картами на 29,8%.', 'Чистые комиссионные доходы увеличились на 9,4%, составив 763,9, несмотря на рост комиссионных расходов на 28,4%, достигших 310,8.', 'Кредитный риск связан с возможными убытками из-за дефолта или ухудшения кредитного качества контрагента. Управление этим риском включает идентификацию, анализ и оценку потенциальных рисков, а также планирование уровня ожидаемых потерь. Основные методы управления включают установление лимитов, работу с обеспечением и формирование резервов для покрытия возможных потерь. Политики и комитеты по управлению рисками играют ключевую роль в минимизации кредитного риска.', 'Комитеты ПАО Сбербанк, такие как комитеты по предоставлению кредитов и инвестиций, рыночным рискам и проблемным активам, занимаются управлением и мониторингом кредитных рисков. Оценка уровня риска осуществляется с помощью статистических моделей и систем кредитных рейтингов, которые учитывают риск-сегменты контрагентов. Эти меры направлены на контроль и снижение кредитного риска в сделках с корпоративными клиентами и другими контрагентами.', 'Сбербанк управляет кредитным риском физических лиц через оценку платежеспособности, экспресс-оценку и анализ поведенческой информации, а также данные из внешних источников. Для ограничения риска применяется многоуровневая система лимитов. Управление рыночным риском торговой книги включает идентификацию и оценку риска, чтобы предотвратить убытки или снижение прибыли из-за неблагоприятных изменений стоимости финансовых инструментов и валют.', 'Политика управления рыночным и кредитным рисками на финансовых рынках включает установление лимитов на различных уровнях портфелей, от агрегированного до отдельных субпортфелей. Основной инструмент оценки рыночного риска — стоимость под риском (VaR), рассчитываемая методом исторического моделирования с 99% доверительной вероятностью на 10-дневном горизонте. Управление рисками осуществляется через комитеты и рабочие органы ПАО Сбербанк, которые имеют делегированные полномочия.', 'Страновой риск связан с возможностью убытков из-за неспособности или нежелания иностранных контрагентов выполнять свои обязательства. Этот риск является частью кредитного риска и управляется через установление лимитов и регулярный мониторинг экономической ситуации в странах, где банк уже имеет или планирует иметь риски. Управление страновым риском включает оценку экономических условий и политической стабильности в соответствующих странах.', 'Риск кибербезопасности связан с угрозами информационной безопасности, возникающими из-за недостатков в процессах защиты данных, программном обеспечении и несоответствии этих процессов деятельности организации. Для управления этим риском в группе используется процессно-ориентированный подход.']
# 	len(img_base64_list)=304
# 	len(image_summaries)=304
# 	['На изображении изображен крупный объемный логотип в виде галочки, наложенный на фон с офисным зданием и зелеными деревьями. Справа текст "Годовой отчет / 2023". Фон яркий, с большими окнами и элементами природы. Цветовая гамма включает зеленые и оранжевые оттенки, создавая современную и свежую атмосферу.', 'На изображении в центре находится женщина в экипировке для велоспорта: шлем оранжевого цвета с черными полосками и защитные очки. Она наклонена вперед, держа руки на руле велосипеда. Фон размыт, с преобладанием зеленых и голубых оттенков, создавая впечатление движения. Также в кадре присутствуют световые линии, которые придают динамику. В левой части изображены надписи: "Сбер в цифрах и фактах". Справа расположен блок с текстом, содержащим пункты, вероятно, содержания или тем раздела.', 'На изображении представлена сцена с рафтингом на реке. Посреди бурной реки плывёт жёлтая надувная лодка с четырьмя людьми. Все участники одеты в яркие защитные костюмы и шлемы. Фон состоит из живописного ландшафта: по обеим сторонам реки возвышаются скалистые берега, покрытые зелёными деревьями. На заднем плане видны высокие зелёные горы, придающие изображению ощущение природной красоты и динамики. Водовороты и брызги на реке добавляют движению реалистичности. В левом нижнем углу имеется текст "Отчёт по рискам".', 'Изображение представляет собой абстрактную композицию, напоминающую разноцветные волны. В центре преобладают яркие оранжевые и жёлтые оттенки, плавно переходящие в бледные белые и голубые области по краям. Текстура поверхности гладкая, с лёгкими бликами, создающими ощущение прозрачности и глубины. На картине отсутствуют конкретные предметы или формы. Это визуально привлекательный, но малоинформативный контент.', 'Изображение представляет собой структурированную таблицу с заголовками и списками, относящимися к различным типам рисков. Всего шесть разделов: \n\n1. **Операционные риски**: несколько пунктов, включая "Операционный риск", "Правовой риск" и другие.\n2. **Рыночные риски**: перечислены такие риски, как "Рыночный риск торговой книги" и другие.\n3. **Прочие риски**: включает "Репутационный риск", "ESG-риск" и другие.\n4. **Кредитные риски**: содержатся пункты "Кредитный риск", "Страновой риск" и другой.\n5. **Бизнес-риски**: перечислены "Стратегический риск", "Риск участия" и другие.\n6. **Риск ликвидности**: указан "Риск ликвидности". \n\nКаждый раздел снабжен иконкой и выделен отдельной рамкой. Внизу справа имеется сноска с указанием на страницы с дополнительной информацией. Цветовая гамма светлая, с зелеными акцентами.', 'На изображении человек на доске для сёрфинга едет по крупной волне. Волна занимает большую часть изображения и окружает сёрфингиста. На фоне виден яркий закат с оранжевыми и жёлтыми облаками, подсвечивающий воду и создающий драматическую и насыщенную цветовую гамму. Человек одет в гидрокостюм, и его силуэт ярко выделяется на фоне переливающейся воды.', 'На изображении двое молодых людей – мужчина и женщина. Они сидят на диване в уютной обстановке, обнявшись. Мужчина с короткими светлыми волосами одет в светлую футболку, женщина с длинными светлыми волосами в легкой светлой кофте. Диван покрыт различными подушками оттенков серого и синего, создавая комфортную атмосферу. На заднем плане видна часть интерьера комнаты с окнами, через которые проникает теплый солнечный свет, добавляя мягкость и уют обстановке.', 'На изображении представлена инфографика с двумя основными разделами: слева информация о клиентах и сотрудниках Сбербанка, справа — трансформация банка.\n\nЛевая часть:\n- Раздел для розничных клиентов: 108,5 млн активных, 81,9 млн в Сбербанк Онлайн и 10 млн подписчиков СберПрайм.\n- Раздел для корпоративных клиентов: 3,2 млн активных, 2,8 млн в СберБизнес Онлайн.\n- Под информацией о клиентах указано 210,8 тыс. сотрудников и около 12 тыс. офисов.\n\nПравая часть:\n- Четыре рубрики: "Надежный банк", "Лидер в цифровом банкинге", "Интегрированная технологическая экосистема" и "На пути к человекоцентричности".\n- Каждая рубрика выделена иконкой и содержит краткую суть: лидерство в депозитах, лучшие банковские приложения, создание финансовых и нефинансовых экосистем.\n\nФон выполнен в светлых тонах с градиентом из желтых и белых оттенков.', 'На изображении человек, вероятно, мужчина, средних лет, поднимается по скалистой горной местности. Он одет в спортивную одежду: футболку и шорты, на ногах крепкие ботинки для треккинга. У него на спине ярко-оранжевый рюкзак. Он использует веревку для страховки при подъеме. Вокруг горный пейзаж с утренним светом, частично скрытым облаками, придающими пейзажу атмосферность. На заднем плане видны холмистые горы и голубое небо с легкими облаками.', 'На изображении изображены трое людей: двое мужчин и одна женщина. Они одеты в деловую одежду: мужчины в костюмах, а женщина в пиджаке и брюках. Все персонажи молодого или среднего возраста. Люди идут по современному офисному пространству с тщательным дизайном. Фон состоит из стеклянных перегородок и светлого интерьера с элементами декора оранжевого цвета. Основной цвет промо-материала — белый, с текстом в нижней части, перечисляющим пункты, видимо, содержания документа о корпоративном управлении.']
# предобработка PDF-файла завершена